{
  "0": "\u0000",
  "1": "\u0001",
  "2": "\u0002",
  "3": "\u0003",
  "4": "\u0004",
  "5": "\u0005",
  "6": "\u0006",
  "7": "\u0007",
  "8": "\b",
  "9": "\t",
  "10": "\n",
  "11": "\u000b",
  "12": "\f",
  "13": "\r",
  "14": "\u000e",
  "15": "\u000f",
  "16": "\u0010",
  "17": "\u0011",
  "18": "\u0012",
  "19": "\u0013",
  "20": "\u0014",
  "21": "\u0015",
  "22": "\u0016",
  "23": "\u0017",
  "24": "\u0018",
  "25": "\u0019",
  "26": "\u001a",
  "27": "\u001b",
  "28": "\u001c",
  "29": "\u001d",
  "30": "\u001e",
  "31": "\u001f",
  "32": " ",
  "33": "!",
  "34": "\"",
  "35": "#",
  "36": "$",
  "37": "%",
  "38": "&",
  "39": "'",
  "40": "(",
  "41": ")",
  "42": "*",
  "43": "+",
  "44": ",",
  "45": "-",
  "46": ".",
  "47": "/",
  "48": "0",
  "49": "1",
  "50": "2",
  "51": "3",
  "52": "4",
  "53": "5",
  "54": "6",
  "55": "7",
  "56": "8",
  "57": "9",
  "58": ":",
  "59": ";",
  "60": "<",
  "61": "=",
  "62": ">",
  "63": "?",
  "64": "@",
  "65": "A",
  "66": "B",
  "67": "C",
  "68": "D",
  "69": "E",
  "70": "F",
  "71": "G",
  "72": "H",
  "73": "I",
  "74": "J",
  "75": "K",
  "76": "L",
  "77": "M",
  "78": "N",
  "79": "O",
  "80": "P",
  "81": "Q",
  "82": "R",
  "83": "S",
  "84": "T",
  "85": "U",
  "86": "V",
  "87": "W",
  "88": "X",
  "89": "Y",
  "90": "Z",
  "91": "[",
  "92": "\\",
  "93": "]",
  "94": "^",
  "95": "_",
  "96": "`",
  "97": "a",
  "98": "b",
  "99": "c",
  "100": "d",
  "101": "e",
  "102": "f",
  "103": "g",
  "104": "h",
  "105": "i",
  "106": "j",
  "107": "k",
  "108": "l",
  "109": "m",
  "110": "n",
  "111": "o",
  "112": "p",
  "113": "q",
  "114": "r",
  "115": "s",
  "116": "t",
  "117": "u",
  "118": "v",
  "119": "w",
  "120": "x",
  "121": "y",
  "122": "z",
  "123": "{",
  "124": "|",
  "125": "}",
  "126": "~",
  "127": "",
  "128": "",
  "129": "",
  "130": "",
  "131": "",
  "132": "",
  "133": "",
  "134": "",
  "135": "",
  "136": "",
  "137": "",
  "138": "",
  "139": "",
  "140": "",
  "141": "",
  "142": "",
  "143": "",
  "144": "",
  "145": "",
  "146": "",
  "147": "",
  "148": "",
  "149": "",
  "150": "",
  "151": "",
  "152": "",
  "153": "",
  "154": "",
  "155": "",
  "156": "",
  "157": "",
  "158": "",
  "159": "",
  "160": " ",
  "161": "¡",
  "162": "¢",
  "163": "£",
  "164": "¤",
  "165": "¥",
  "166": "¦",
  "167": "§",
  "168": "¨",
  "169": "©",
  "170": "ª",
  "171": "«",
  "172": "¬",
  "173": "­",
  "174": "®",
  "175": "¯",
  "176": "°",
  "177": "±",
  "178": "²",
  "179": "³",
  "180": "´",
  "181": "µ",
  "182": "¶",
  "183": "·",
  "184": "¸",
  "185": "¹",
  "186": "º",
  "187": "»",
  "188": "¼",
  "189": "½",
  "190": "¾",
  "191": "¿",
  "192": "À",
  "193": "Á",
  "194": "Â",
  "195": "Ã",
  "196": "Ä",
  "197": "Å",
  "198": "Æ",
  "199": "Ç",
  "200": "È",
  "201": "É",
  "202": "Ê",
  "203": "Ë",
  "204": "Ì",
  "205": "Í",
  "206": "Î",
  "207": "Ï",
  "208": "Ð",
  "209": "Ñ",
  "210": "Ò",
  "211": "Ó",
  "212": "Ô",
  "213": "Õ",
  "214": "Ö",
  "215": "×",
  "216": "Ø",
  "217": "Ù",
  "218": "Ú",
  "219": "Û",
  "220": "Ü",
  "221": "Ý",
  "222": "Þ",
  "223": "ß",
  "224": "à",
  "225": "á",
  "226": "â",
  "227": "ã",
  "228": "ä",
  "229": "å",
  "230": "æ",
  "231": "ç",
  "232": "è",
  "233": "é",
  "234": "ê",
  "235": "ë",
  "236": "ì",
  "237": "í",
  "238": "î",
  "239": "ï",
  "240": "ð",
  "241": "ñ",
  "242": "ò",
  "243": "ó",
  "244": "ô",
  "245": "õ",
  "246": "ö",
  "247": "÷",
  "248": "ø",
  "249": "ù",
  "250": "ú",
  "251": "û",
  "252": "ü",
  "253": "ý",
  "254": "þ",
  "255": "ÿ",
  "256": "  ",
  "257": "\\\\",
  "258": "\n  ",
  "259": "\",",
  "260": ": ",
  "261": "\": ",
  "262": "\n  \"",
  "263": "\",\n  \"",
  "264": "\": \"",
  "265": "\\\\\\\\",
  "266": "\",\n  \"2",
  "267": "\",\n  \"1",
  "268": "n  ",
  "269": "\\\\\\\\\\\\\\\\",
  "270": "te",
  "271": "\\\"",
  "272": "\\n  ",
  "273": "on",
  "274": "\",\n  \"3",
  "275": "th",
  "276": "er",
  "277": "\n    ",
  "278": "re",
  "279": ", ",
  "280": "\\\",",
  "281": "at",
  "282": "in",
  "283": "en",
  "284": "t ",
  "285": "ra",
  "286": "= ",
  "287": "gl",
  "288": "is",
  "289": "3\": \"",
  "290": "4\": \"",
  "291": "7\": \"",
  "292": "1\": \"",
  "293": "6\": \"",
  "294": "5\": \"",
  "295": "9\": \"",
  "296": "2\": \"",
  "297": "8\": \"",
  "298": "0\": \"",
  "299": ");",
  "300": "or",
  "301": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\",
  "302": "gl.",
  "303": " {",
  "304": " = ",
  "305": "\\n  \\\"",
  "306": "\\\",\\n  \\\"",
  "307": "tex",
  "308": "this",
  "309": "con",
  "310": "this.",
  "311": "    ",
  "312": "\\\\n  ",
  "313": " *",
  "314": "le",
  "315": "al",
  "316": "ram",
  "317": "\\\": ",
  "318": "ri",
  "319": "e ",
  "320": "\\\\\\\"",
  "321": "ro",
  "322": "id",
  "323": "ad",
  "324": " * ",
  "325": "/ ",
  "326": "cons",
  "327": "text",
  "328": "**",
  "329": "oc",
  "330": "\n      ",
  "331": "\\\",\\n  \\\"3",
  "332": "00",
  "333": "to",
  "334": "// ",
  "335": "ut",
  "336": "const ",
  "337": "iz",
  "338": "co",
  "339": "ig",
  "340": "pa",
  "341": "ent",
  "342": "\\\": \\\"",
  "343": "\\\\\\\",",
  "344": "de",
  "345": "he",
  "346": "rea",
  "347": "ion",
  "348": "\\n    ",
  "349": "ff",
  "350": "bo",
  "351": "ge",
  "352": "ten",
  "353": "ffer",
  "354": "atri",
  "355": "uffer",
  "356": "atrix",
  "357": ") {",
  "358": "ht",
  "359": "tu",
  "360": "('",
  "361": "ment",
  "362": "\",\n  \"34",
  "363": "\",\n  \"33",
  "364": "\",\n  \"32",
  "365": "\",\n  \"31",
  "366": "\",\n  \"29",
  "367": "\",\n  \"28",
  "368": "\",\n  \"27",
  "369": "\",\n  \"26",
  "370": "\",\n  \"25",
  "371": "\",\n  \"24",
  "372": "\",\n  \"23",
  "373": "\",\n  \"22",
  "374": "\",\n  \"21",
  "375": "\",\n  \"19",
  "376": "\",\n  \"18",
  "377": "\",\n  \"17",
  "378": "\",\n  \"16",
  "379": "\",\n  \"15",
  "380": "\",\n  \"14",
  "381": "\",\n  \"13",
  "382": "\",\n  \"12",
  "383": "\",\n  \"11",
  "384": "\",\n  \"9",
  "385": "\",\n  \"8",
  "386": "\",\n  \"7",
  "387": "\",\n  \"6",
  "388": "\",\n  \"5",
  "389": "\",\n  \"4",
  "390": "ab",
  "391": "ata",
  "392": "s ",
  "393": "this.gl.",
  "394": "\\n",
  "395": "ul",
  "396": " * @",
  "397": "st",
  "398": "w ",
  "399": "\\n      ",
  "400": "ne",
  "401": "\\\\\\\\n  ",
  "402": "\",\n  \"30",
  "403": "\",\n  \"20",
  "404": "\",\n  \"10",
  "405": "for",
  "406": "lo",
  "407": "ing",
  "408": "</",
  "409": "d ",
  "410": "pl",
  "411": "eb",
  "412": "ord",
  "413": "ma",
  "414": "} ",
  "415": "it",
  "416": "RA",
  "417": "0, ",
  "418": "gram",
  "419": "rogram",
  "420": "ex",
  "421": ");\n    ",
  "422": "as",
  "423": " (",
  "424": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\",
  "425": "heig",
  "426": "the ",
  "427": "\\\\n  \\\\\\\"",
  "428": "TE",
  "429": "iv",
  "430": "ken",
  "431": "\\\\\\\",\\\\n  \\\\\\\"",
  "432": "ocab",
  "433": "/**",
  "434": "reate",
  "435": "idth",
  "436": "un",
  "437": "Con",
  "438": "an",
  "439": "create",
  "440": "ize",
  "441": "ram {",
  "442": "param {",
  "443": " * @param {",
  "444": "\\\\\\\\\\\\\\\"",
  "445": "RE",
  "446": "loat",
  "447": "Tex",
  "448": "es",
  "449": "ct",
  "450": " +",
  "451": "width",
  "452": "alu",
  "453": "ic",
  "454": "\\\\\\\": ",
  "455": "height",
  "456": "ER",
  "457": "ar",
  "458": "vocab",
  "459": "new ",
  "460": " */",
  "461": "had",
  "462": "el",
  "463": "matrix",
  "464": "\\\",\\n  \\\"2",
  "465": "hader",
  "466": "ME",
  "467": " s",
  "468": "TU",
  "469": "ac",
  "470": "qu",
  "471": "px",
  "472": ";\n      ",
  "473": "ation",
  "474": "ter",
  "475": "rn",
  "476": "FER",
  "477": "(gl.",
  "478": "FFER",
  "479": "ure",
  "480": "Co",
  "481": "\\\\n    ",
  "482": "UFFER",
  "483": "if",
  "484": "ir",
  "485": "BUFFER",
  "486": "turn",
  "487": "TEX",
  "488": "}\n",
  "489": "; ",
  "490": "return",
  "491": "TURE",
  "492": "2D",
  "493": "put",
  "494": "to ",
  "495": "token",
  "496": "\\\\n",
  "497": "TEXTURE",
  "498": "program",
  "499": "\\\\\\\\\\\\\\\\r",
  "500": "Conten",
  "501": ";\n    ",
  "502": "\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\",
  "503": "texture",
  "504": "Js",
  "505": "data",
  "506": "ix",
  "507": "32",
  "508": "valu",
  "509": "lement",
  "510": "t = ",
  "511": "um",
  "512": "Data",
  "513": "ebuffer",
  "514": "In",
  "515": "pu",
  "516": "\\\\n      ",
  "517": "ramebuffer",
  "518": "ray",
  "519": " + ",
  "520": ": 1",
  "521": "\\\": \\\"\",\n  \"7",
  "522": "TEXTURE_",
  "523": "Matrix",
  "524": "ture",
  "525": "rray",
  "526": "get",
  "527": "str",
  "528": "se",
  "529": "pair",
  "530": "\\\": \\\"\",\n  \"6",
  "531": "ixel",
  "532": "Buffer",
  "533": "dy",
  "534": "');",
  "535": "Array",
  "536": "\\\\\\\\\\\\\\\",",
  "537": "u00",
  "538": "Texture",
  "539": "0.",
  "540": "body",
  "541": "ment.",
  "542": "At",
  "543": "code",
  "544": "BUFFER, ",
  "545": "GL",
  "546": "utput",
  "547": "ult",
  "548": "il",
  "549": ") ",
  "550": "ton",
  "551": "output",
  "552": "FRA",
  "553": "Coord",
  "554": "utton",
  "555": " the ",
  "556": "\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\n  ",
  "557": "\\\",\\n  \\\"33",
  "558": "ebGL",
  "559": "Element",
  "560": "if (",
  "561": " n",
  "562": ";\\n      ",
  "563": "FRAME",
  "564": "Loc",
  "565": "fbo",
  "566": "WebGL",
  "567": "tri",
  "568": "tr",
  "569": "To",
  "570": "ec",
  "571": "all",
  "572": "ap",
  "573": "ber",
  "574": "****",
  "575": "ument.",
  "576": "reak",
  "577": "ing ",
  "578": "umber",
  "579": "trib",
  "580": "ror",
  "581": "ocument.",
  "582": "\\\\\\\",\\\\n  \\\\\\\"3",
  "583": "float",
  "584": "sit",
  "585": "form",
  "586": "js",
  "587": "document.",
  "588": "cl",
  "589": "s.",
  "590": "mage",
  "591": "Attrib",
  "592": "(this.",
  "593": "col",
  "594": ", '",
  "595": "context",
  "596": "us",
  "597": ") {\n    ",
  "598": "pixel",
  "599": "AT",
  "600": "rc",
  "601": "sc",
  "602": "Lo",
  "603": "Div",
  "604": ");\n",
  "605": "Id",
  "606": " = 0",
  "607": "mageData",
  "608": "Float",
  "609": "izer",
  "610": "\n  const ",
  "611": "\\\",\\n  \\\"32",
  "612": "in-",
  "613": "iform",
  "614": "TEXTURE_2D",
  "615": "com",
  "616": "Framebuffer",
  "617": "dex",
  "618": "Log",
  "619": "order",
  "620": "- ",
  "621": ");\\n    ",
  "622": "cen",
  "623": "TEXTURE_2D, ",
  "624": "Shader",
  "625": "ror('",
  "626": "rip",
  "627": "ign",
  "628": ".in",
  "629": "\\\\\\\\n",
  "630": "97\": \"",
  "631": "96\": \"",
  "632": "95\": \"",
  "633": "94\": \"",
  "634": "93\": \"",
  "635": "92\": \"",
  "636": "90\": \"",
  "637": "89\": \"",
  "638": "86\": \"",
  "639": "84\": \"",
  "640": "83\": \"",
  "641": "81\": \"",
  "642": "80\": \"",
  "643": "79\": \"",
  "644": "76\": \"",
  "645": "75\": \"",
  "646": "74\": \"",
  "647": "73\": \"",
  "648": "71\": \"",
  "649": "69\": \"",
  "650": "67\": \"",
  "651": "66\": \"",
  "652": "64\": \"",
  "653": "63\": \"",
  "654": "59\": \"",
  "655": "57\": \"",
  "656": "54\": \"",
  "657": "53\": \"",
  "658": "50\": \"",
  "659": "body>",
  "660": "Index",
  "661": "matrixS",
  "662": "data[",
  "663": "(gl.FRAME",
  "664": "bin",
  "665": "ical",
  "666": "scrip",
  "667": "nd",
  "668": "border",
  "669": "',",
  "670": "div",
  "671": "ta",
  "672": " = document.",
  "673": ").",
  "674": "1.",
  "675": " in",
  "676": "of",
  "677": "48\": \"",
  "678": "45\": \"",
  "679": "44\": \"",
  "680": "43\": \"",
  "681": "42\": \"",
  "682": "41\": \"",
  "683": "40\": \"",
  "684": "39\": \"",
  "685": "38\": \"",
  "686": "37\": \"",
  "687": "35\": \"",
  "688": "34\": \"",
  "689": "33\": \"",
  "690": "32\": \"",
  "691": "31\": \"",
  "692": "30\": \"",
  "693": "28\": \"",
  "694": "27\": \"",
  "695": "26\": \"",
  "696": "25\": \"",
  "697": "24\": \"",
  "698": "23\": \"",
  "699": "21\": \"",
  "700": "15\": \"",
  "701": "14\": \"",
  "702": "13\": \"",
  "703": "91\": \"",
  "704": "88\": \"",
  "705": "87\": \"",
  "706": "82\": \"",
  "707": "78\": \"",
  "708": "77\": \"",
  "709": "72\": \"",
  "710": "68\": \"",
  "711": "65\": \"",
  "712": "62\": \"",
  "713": "61\": \"",
  "714": "60\": \"",
  "715": "58\": \"",
  "716": "56\": \"",
  "717": "52\": \"",
  "718": "51\": \"",
  "719": "\\\\\\\": \\\\\\\"",
  "720": ": 100",
  "721": "center",
  "722": "pixelIndex",
  "723": "matrixSize",
  "724": "texCoord",
  "725": "!} ",
  "726": "anv",
  "727": "d(",
  "728": "end",
  "729": "ou",
  "730": "-con",
  "731": " = new ",
  "732": "\\\\\\\\\\\\\\\": ",
  "733": "49\": \"",
  "734": "47\": \"",
  "735": "46\": \"",
  "736": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\"",
  "737": "36\": \"",
  "738": "22\": \"",
  "739": "19\": \"",
  "740": "17\": \"",
  "741": "12\": \"",
  "742": "11\": \"",
  "743": "10\": \"",
  "744": "99\": \"",
  "745": "98\": \"",
  "746": "85\": \"",
  "747": "55\": \"",
  "748": "imageData",
  "749": "bind",
  "750": "ertex",
  "751": "Program",
  "752": "icalMatrix",
  "753": "thro",
  "754": " id",
  "755": " = 0; ",
  "756": "y ",
  "757": "29\": \"",
  "758": "18\": \"",
  "759": "16\": \"",
  "760": "70\": \"",
  "761": "data[pixelIndex",
  "762": "_create",
  "763": "LogicalMatrix",
  "764": "anvas",
  "765": "allJs",
  "766": "outputDiv",
  "767": "pla",
  "768": "25",
  "769": "\n   * @param {",
  "770": ";\n  ",
  "771": "s {",
  "772": "@t",
  "773": "20\": \"",
  "774": "09\": \"",
  "775": "07\": \"",
  "776": "06\": \"",
  "777": "05\": \"",
  "778": "02\": \"",
  "779": "01\": \"",
  "780": "00\": \"",
  "781": "\": \",",
  "782": ": center",
  "783": ".data[pixelIndex",
  "784": "vec",
  "785": "allJsConten",
  "786": "button",
  "787": "ite",
  "788": "tain",
  "789": "ispla",
  "790": "throw ",
  "791": "break",
  "792": "pe",
  "793": "ile",
  "794": "ion ",
  "795": "returns {",
  "796": "quen",
  "797": "08\": \"",
  "798": "04\": \"",
  "799": "03\": \"",
  "800": "\\\",\\n  \\\"34",
  "801": "\\u00",
  "802": "imageData.data[pixelIndex",
  "803": "32Array",
  "804": " = this.",
  "805": "Er",
  "806": "quad",
  "807": "ml",
  "808": "om",
  "809": ") {\n      ",
  "810": "let ",
  "811": "s(",
  "812": "a ",
  "813": " * @returns {",
  "814": "\\\\\\\\n  \\\\\\\\\\\\\\\"",
  "815": "vh",
  "816": "imageData.data[pixelIndex + ",
  "817": "LO",
  "818": "Float32Array",
  "819": "(program",
  "820": "shader",
  "821": "lete",
  "822": "color",
  "823": "new Er",
  "824": "html",
  "825": "ipl",
  "826": "ull",
  "827": "add",
  "828": "coded",
  "829": "isplay",
  "830": "ch",
  "831": "\n  /**",
  "832": "Pa",
  "833": "1]",
  "834": "Th",
  "835": "\\\\\\\\\\\\\\\",\\\\\\\\n  \\\\\\\\\\\\\\\"",
  "836": "\\\",\\n  \\\"30",
  "837": "<body>",
  "838": "align",
  "839": "(gl.FRAMEBUFFER, ",
  "840": "(this.gl.",
  "841": "throw new Er",
  "842": "rag",
  "843": "ultipl",
  "844": ".js",
  "845": "Json",
  "846": "able",
  "847": "ner",
  "848": "Token",
  "849": "plac",
  "850": "mer",
  "851": "ids",
  "852": "rom",
  "853": "\": \": ",
  "854": ": 100vh",
  "855": "height: 100vh",
  "856": "values",
  "857": "di",
  "858": "Y_",
  "859": "comp",
  "860": "ST",
  "861": "NT",
  "862": "frag",
  "863": "ot ",
  "864": "ON",
  "865": "ad>",
  "866": "ect",
  "867": ".inner",
  "868": "Ch",
  "869": " */\n  ",
  "870": "\n   */\n  ",
  "871": "ype",
  "872": "tokenizer",
  "873": "string",
  "874": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\r",
  "875": "\\\\\\\\n      ",
  "876": "\\\\\\\\n    ",
  "877": "\\\",\\n  \\\"31",
  "878": "in-height: 100vh",
  "879": "ms",
  "880": "uniform",
  "881": "RAY_",
  "882": "MENT",
  "883": "throw new Error('",
  "884": "men",
  "885": ": '",
  "886": "ild(",
  "887": "');\n    ",
  "888": "ular",
  "889": "number",
  "890": "ck",
  "891": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\",
  "892": "r\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\",
  "893": "\\\",\\n  \\\"1",
  "894": "min-height: 100vh",
  "895": "RRAY_",
  "896": "CO",
  "897": "Child(",
  "898": "app",
  "899": "Element('",
  "900": "res",
  "901": "=>",
  "902": "ial",
  "903": "id ",
  "904": ");\n      ",
  "905": "${",
  "906": "of ",
  "907": "heck",
  "908": ";\\\\n      ",
  "909": "\\\\\\\": \\\\\\\"\\\",\\n  \\\"",
  "910": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\",
  "911": "px;\n      ",
  "912": "items",
  "913": "=\"",
  "914": "sity",
  "915": ", matrixSize",
  "916": "(gl.TEXTURE_2D, ",
  "917": "HMENT",
  "918": "ARRAY_",
  "919": "1.0, ",
  "920": "vec2",
  "921": "canvas",
  "922": "this.quad",
  "923": "Context",
  "924": "for ",
  "925": "gpu",
  "926": "it ",
  "927": "></",
  "928": "rg",
  "929": "endChild(",
  "930": "createElement('",
  "931": "fo",
  "932": "if (!",
  "933": "\n  /**\n  ",
  "934": " <",
  "935": "for (",
  "936": "The ",
  "937": "ce ",
  "938": "}\\n",
  "939": "\": \", ",
  "940": "border-",
  "941": "-items",
  "942": "head>",
  "943": "float(",
  "944": "tensity",
  "945": "p>",
  "946": "CHMENT",
  "947": "(this.gl.ARRAY_",
  "948": "und",
  "949": "appendChild(",
  "950": " = document.createElement('",
  "951": "HT",
  "952": "ack",
  "953": "c ",
  "954": "and ",
  "955": "itial",
  "956": "(text",
  "957": "ce",
  "958": "gth",
  "959": "St",
  "960": "ID",
  "961": "\\\",\\n  \\\"25",
  "962": "align-items",
  "963": "html>",
  "964": "intensity",
  "965": "ACHMENT",
  "966": "ertexAttrib",
  "967": "(this.gl.ARRAY_BUFFER, ",
  "968": "0.0, ",
  "969": "e = ",
  "970": "LogicalMatrix!} ",
  "971": "tent",
  "972": " not ",
  "973": "er('",
  "974": "ess",
  "975": "ol",
  "976": ".appendChild(",
  "977": "le.",
  "978": "Ma",
  "979": "ML",
  "980": "tainer",
  "981": "back",
  "982": ".re",
  "983": "}\n\n    ",
  "984": "By",
  "985": "im",
  "986": ";\n",
  "987": "ength",
  "988": "Stat",
  "989": "\\\\\\\",\\\\n  \\\\\\\"33",
  "990": "align-items: center",
  "991": "src",
  "992": "Valu",
  "993": "ndom",
  "994": "A_",
  "995": "TACHMENT",
  "996": "Multipl",
  "997": "Po",
  "998": "tener('",
  "999": "round",
  "1000": "ject",
  "1001": "ong",
  "1002": "HTML",
  "1003": "Id('",
  "1004": "// B",
  "1005": "ization",
  "1006": "text ",
  "1007": "th.",
  "1008": "merge",
  "1009": "length",
  "1010": "ction ",
  "1011": "from",
  "1012": "map",
  "1013": "quence ",
  "1014": "check",
  "1015": "\\\",\\n  \\\"30\",\n  \"30",
  "1016": "\\n   * @param {",
  "1017": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\",",
  "1018": ";\\n    ",
  "1019": "t src",
  "1020": "random",
  "1021": "ate",
  "1022": "width * ",
  "1023": "ATTACHMENT",
  "1024": "AttribLoc",
  "1025": " = new Float32Array",
  "1026": "ach",
  "1027": "ourc",
  "1028": "********",
  "1029": "buffer",
  "1030": "mm",
  "1031": "istener('",
  "1032": "ground",
  "1033": "dd",
  "1034": "sty",
  "1035": "strong",
  "1036": "textConten",
  "1037": "pre",
  "1038": "ById('",
  "1039": "po",
  "1040": "()",
  "1041": "mo",
  "1042": "ype {",
  "1043": "or(",
  "1044": "PE",
  "1045": " {\n      ",
  "1046": "i]",
  "1047": " ID",
  "1048": "\\\",\\n  \\\"34\",\n  \"29",
  "1049": ");\\\\n    ",
  "1050": "\\\\\\\",\\\\n  \\\\\\\"2",
  "1051": "\\\",\\n  \\\"29",
  "1052": "\\u001",
  "1053": "script src",
  "1054": "p in",
  "1055": "am",
  "1056": "Math.",
  "1057": "this.height",
  "1058": "B_",
  "1059": "_ATTACHMENT",
  "1060": "(gl.FRAMEBUFFER, gl.",
  "1061": ");\n    gl.",
  "1062": "tom",
  "1063": "MP",
  "1064": "(shader",
  "1065": "framebuffer",
  "1066": "aile",
  "1067": "place",
  "1068": "Re",
  "1069": "Listener('",
  "1070": "ert",
  "1071": "marg",
  "1072": "background",
  "1073": "strong>",
  "1074": "outputDiv.appendChild(",
  "1075": ".innerHTML",
  "1076": "');\n  ",
  "1077": "ElementById('",
  "1078": "s to ",
  "1079": " |",
  "1080": "top",
  "1081": "vocab.",
  "1082": "size",
  "1083": "vocabular",
  "1084": "@type {",
  "1085": "clas",
  "1086": "pair[",
  "1087": "return ",
  "1088": "++",
  "1089": "i <",
  "1090": "let i",
  "1091": ");\n  ",
  "1092": "s-",
  "1093": "\\\",\\n  \\\"33\",\n  \"30",
  "1094": ": #",
  "1095": "-content",
  "1096": "tep in",
  "1097": "value ",
  "1098": "R_ATTACHMENT",
  "1099": "2D(gl.FRAMEBUFFER, gl.",
  "1100": "context.",
  "1101": "ttom",
  "1102": "ft",
  "1103": ", this.gl.",
  "1104": "rame",
  "1105": "tach",
  "1106": "}\n    ",
  "1107": "(/",
  "1108": "// Re",
  "1109": "script",
  "1110": "ard",
  "1111": "entListener('",
  "1112": "vocabJson",
  "1113": "style",
  "1114": ".innerHTML = ",
  "1115": "-container",
  "1116": "getElementById('",
  "1117": "\n        ",
  "1118": "initial",
  "1119": "c.",
  "1120": "fin",
  "1121": "\n  /**\n   * ",
  "1122": " @type {",
  "1123": "== ",
  "1124": "idx",
  "1125": ") + ",
  "1126": "token ID",
  "1127": "- The ",
  "1128": "\n\n",
  "1129": "\\n  <",
  "1130": "dius",
  "1131": "color: #",
  "1132": "y-content",
  "1133": "\n  <",
  "1134": " step in",
  "1135": "gl.TEXTURE_",
  "1136": "LOR_ATTACHMENT",
  "1137": "Texture2D(gl.FRAMEBUFFER, gl.",
  "1138": "(this.gl.ARRAY_BUFFER, this.quad",
  "1139": "left",
  "1140": "Parame",
  "1141": "attach",
  "1142": "vec2 ",
  "1143": " null",
  "1144": "place(/",
  "1145": "allJsContent",
  "1146": "pbo",
  "1147": "yn",
  "1148": ";\n    }\n\n    ",
  "1149": "ase ",
  "1150": "Button",
  "1151": "ventListener('",
  "1152": "; // ",
  "1153": "\n  // ",
  "1154": "output-container",
  "1155": "); ",
  "1156": "} */",
  "1157": "/** @type {",
  "1158": "uct",
  "1159": "En",
  "1160": " w",
  "1161": "}\n\n",
  "1162": "t(",
  "1163": "[i]",
  "1164": "i++",
  "1165": "let i = 0; ",
  "1166": "quence of ",
  "1167": "\\\",\\n  \\\"32\",\n  \"30",
  "1168": "\\n\\n",
  "1169": "\\n  /**",
  "1170": ") {\\n      ",
  "1171": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\"",
  "1172": ");\\n",
  "1173": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n  ",
  "1174": "</html>",
  "1175": "</head>",
  "1176": "radius",
  "1177": "ont",
  "1178": "ify-content",
  "1179": "/ float(",
  "1180": "1 step in",
  "1181": "imageData.data[pixelIndex + 2",
  "1182": "Tim",
  "1183": "GE",
  "1184": "(gl.TEXTURE_2D, gl.TEXTURE_",
  "1185": "width * this.height",
  "1186": "(program, '",
  "1187": "0, 0, ",
  "1188": "complete",
  "1189": "COLOR_ATTACHMENT",
  "1190": "framebufferTexture2D(gl.FRAMEBUFFER, gl.",
  "1191": "heigh",
  "1192": "ertexAttribArray",
  "1193": "Buffer(this.gl.ARRAY_BUFFER, this.quad",
  "1194": ");\n    this.gl.",
  "1195": "ole.",
  "1196": "ailed ",
  "1197": "sition",
  "1198": "mm_",
  "1199": ".replace(/",
  "1200": "allJsContent = ",
  "1201": "wa",
  "1202": "ipbo",
  "1203": "asyn",
  "1204": "tokenize",
  "1205": "EventListener('",
  "1206": "and",
  "1207": "ow",
  "1208": "id #",
  "1209": "`<",
  "1210": "textContent = ",
  "1211": "pro",
  "1212": "decoded",
  "1213": "display",
  "1214": "map(",
  "1215": "(a",
  "1216": ");\n\n    ",
  "1217": "(text, ",
  "1218": "truct",
  "1219": "class ",
  "1220": "}\n  ",
  "1221": ") {\n    const ",
  "1222": "for (let i = 0; ",
  "1223": "fun",
  "1224": "[]",
  "1225": "s-check",
  "1226": "px;\\n      ",
  "1227": ";\\\\\\\\n      ",
  "1228": "\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\n",
  "1229": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\": ",
  "1230": "\\\\u00",
  "1231": "\\n  const ",
  "1232": ") {\\n    ",
  "1233": "box",
  "1234": "border-radius",
  "1235": "background-",
  "1236": "stify-content",
  "1237": "ing 1 step in",
  "1238": "0.5",
  "1239": "reen",
  "1240": "ONS",
  "1241": "DGE",
  "1242": "REST",
  "1243": "ri(gl.TEXTURE_2D, gl.TEXTURE_",
  "1244": "(this.width * this.height",
  "1245": "i(this.",
  "1246": "ation(program, '",
  "1247": "Status",
  "1248": "framebufferTexture2D(gl.FRAMEBUFFER, gl.COLOR_ATTACHMENT",
  "1249": " = this.context.",
  "1250": "VertexAttribArray",
  "1251": "0, 0",
  "1252": "bindBuffer(this.gl.ARRAY_BUFFER, this.quad",
  "1253": " = this.gl.",
  "1254": "ver",
  "1255": "console.",
  "1256": "matrix ",
  "1257": " = this._create",
  "1258": "delete",
  "1259": "texture ",
  "1260": "gpu.",
  "1261": "ailed to ",
  "1262": " = gl.",
  "1263": "por",
  "1264": "Un",
  "1265": "allJsContent.replace(/",
  "1266": "pon",
  "1267": "ick",
  "1268": "addEventListener('",
  "1269": "-w",
  "1270": "f9",
  "1271": "olid #",
  "1272": "adding",
  "1273": "Text",
  "1274": "Vocab",
  "1275": "itle",
  "1276": "Res",
  "1277": "encoded",
  "1278": "Display",
  "1279": "put ",
  "1280": " and ",
  "1281": "Number",
  "1282": ", b",
  "1283": "Str",
  "1284": "this.vocab.",
  "1285": "string} ",
  "1286": "construct",
  "1287": "wh",
  "1288": "; i++",
  "1289": "for (let i = 0; i <",
  "1290": "function ",
  "1291": "quence of token ID",
  "1292": "@ts-check",
  "1293": "1\",\n  \"32",
  "1294": "\\\",\\n  \\\"29\",\n  \"30",
  "1295": " id=",
  "1296": "\\\\n\\\\n",
  "1297": "\\n        ",
  "1298": ");\\n    gl.",
  "1299": "\\\\n   * @param {",
  "1300": ";\\\\n    ",
  "1301": "\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\n      ",
  "1302": "\\\\\\\\\\\\\\\": \\\\\\\\\\\\\\\"",
  "1303": "\\\\\\\",\\\\n  \\\\\\\"32",
  "1304": "\\\\\\\": \\\\\\\"\\\",\\n  \\\"7",
  "1305": "\\\",\\n  \\\"33\",\n  \"3",
  "1306": "#output-container",
  "1307": "border-radius: ",
  "1308": "font",
  "1309": "ustify-content",
  "1310": ">\n    ",
  "1311": "></script",
  "1312": "YPE",
  "1313": "ving 1 step in",
  "1314": "Green",
  "1315": " = 0; // ",
  "1316": "intensity = ",
  "1317": "IONS",
  "1318": ", matrixSize, '",
  "1319": "EDGE",
  "1320": "AREST",
  "1321": "teri(gl.TEXTURE_2D, gl.TEXTURE_",
  "1322": " = new Float32Array(this.width * this.height",
  "1323": "1i(this.",
  "1324": "Location(program, '",
  "1325": "gl.TEXTURE_2D, ",
  "1326": "framebufferTexture2D(gl.FRAMEBUFFER, gl.COLOR_ATTACHMENT0, ",
  "1327": "ixels(",
  "1328": "ableVertexAttribArray",
  "1329": "LOAT",
  "1330": "ource",
  "1331": "essa",
  "1332": "uad",
  "1333": "ute",
  "1334": "sion",
  "1335": " texture",
  "1336": "for the ",
  "1337": "row",
  "1338": "TexCoord",
  "1339": " | null",
  "1340": "this.mm_",
  "1341": "gl = ",
  "1342": "allJsContent = allJsContent.replace(/",
  "1343": "respon",
  "1344": "wait ",
  "1345": "ipboard",
  "1346": "ment ",
  "1347": "click",
  "1348": "?.",
  "1349": "-button",
  "1350": "SON",
  "1351": ": 'break",
  "1352": "reak: 'break",
  "1353": " solid #",
  "1354": "padding",
  "1355": " = document.getElementById('",
  "1356": ";\n  }\n",
  "1357": "map(Number",
  "1358": "255",
  "1359": "(0",
  "1360": "Code",
  "1361": "rain",
  "1362": "tokenizer.",
  "1363": "Pair",
  "1364": "Map",
  "1365": "number[]",
  "1366": " a",
  "1367": "s the ",
  "1368": "// @ts-check",
  "1369": "\\\",\\n  \\\"31\",\n  \"30",
  "1370": "\\\",\\n  \\\"33\",\n  \"300",
  "1371": "\",\n  \"200",
  "1372": "script src=",
  "1373": ");\\n    this.gl.",
  "1374": "\\\\n  <",
  "1375": "\",\n  \"100",
  "1376": "\\n  /**\\n  ",
  "1377": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n  ",
  "1378": " */\\n  ",
  "1379": "\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\n  \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\"",
  "1380": "\\\": \\\"\",\n  \"29",
  "1381": "\\u000",
  "1382": "margin-",
  "1383": "background-color: #",
  "1384": "justify-content",
  "1385": "TYPE",
  "1386": "moving 1 step in",
  "1387": "element",
  "1388": " = 0; // Green",
  "1389": "flo",
  "1390": "const intensity = ",
  "1391": "values[i]",
  "1392": "TIONS",
  "1393": ", matrixSize, matrixSize, '",
  "1394": "context, matrixSize, matrixSize, '",
  "1395": "now",
  "1396": "Math.random",
  "1397": "_EDGE",
  "1398": "_T",
  "1399": "EAREST",
  "1400": "Parameteri(gl.TEXTURE_2D, gl.TEXTURE_",
  "1401": ", gl.",
  "1402": "ase '",
  "1403": "uniform1i(this.",
  "1404": "iformLocation(program, '",
  "1405": " not complete",
  "1406": "framebufferTexture2D(gl.FRAMEBUFFER, gl.COLOR_ATTACHMENT0, gl.TEXTURE_2D, ",
  "1407": "bindFramebuffer",
  "1408": "width, ",
  "1409": "Pixels(",
  "1410": "enableVertexAttribArray",
  "1411": ", 0, 0",
  "1412": "FLOAT",
  "1413": "RAW",
  "1414": "ght",
  "1415": "1.0, 0.0, ",
  "1416": "Info",
  "1417": "log",
  "1418": "messa",
  "1419": "Quad",
  "1420": "Multiply",
  "1421": "ailed to create",
  "1422": "buffer_",
  "1423": " h",
  "1424": "WebGL ",
  "1425": ") {\n      throw new Error('",
  "1426": "} fbo",
  "1427": "is ",
  "1428": "\n      '",
  "1429": ".');\n    ",
  "1430": "clipboard",
  "1431": "addEventListener('click",
  "1432": "=> {",
  "1433": "DO",
  "1434": "y-",
  "1435": "null",
  "1436": "JSON",
  "1437": "ication",
  "1438": "().",
  "1439": "Break: 'break",
  "1440": "rap",
  "1441": "fe",
  "1442": "px solid #",
  "1443": "vo",
  "1444": ".length",
  "1445": "Tokenization",
  "1446": "--",
  "1447": "re ",
  "1448": "Result",
  "1449": ").map(Number",
  "1450": "(a, b",
  "1451": "arCode",
  "1452": ".from",
  "1453": "vocab_",
  "1454": "constructor(",
  "1455": "Tokenizer",
  "1456": "0]",
  "1457": ", idx",
  "1458": "| ",
  "1459": "number[]} ",
  "1460": "fre",
  "1461": "\\n  <\",\n  \"32",
  "1462": "\\\\\\\",\\\\n  \\\\\\\"33\\\",\\n  \\\"29\",\n  \"30",
  "1463": "\\\": \\\"\\\\u00",
  "1464": "}\\n  ",
  "1465": "');\\n    ",
  "1466": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\n  \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\"",
  "1467": "\\\\\\\\\\\\\\\",\\\\\\\\n  \\\\\\\\\\\\\\\"2",
  "1468": "\\\\\\\": \\\\\\\"\\\",\\n  \\\"6",
  "1469": "\": \": 1",
  "1470": ">\n    <",
  "1471": "font-",
  "1472": "justify-content: center",
  "1473": "CTYPE",
  "1474": "s to moving 1 step in",
  "1475": "d_",
  "1476": "1] = 0; // Green",
  "1477": "const intensity = value ",
  "1478": "anne",
  "1479": "e = values[i]",
  "1480": "min",
  "1481": "Value",
  "1482": "max",
  "1483": "</p>",
  "1484": "mad",
  "1485": "RATIONS",
  "1486": "gpu.context, matrixSize, matrixSize, '",
  "1487": ".now",
  "1488": "data = new Float32Array(this.width * this.height",
  "1489": ") - ",
  "1490": "O_EDGE",
  "1491": "NEAREST",
  "1492": "texParameteri(gl.TEXTURE_2D, gl.TEXTURE_",
  "1493": "case '",
  "1494": "a.",
  "1495": "A_width",
  "1496": "UniformLocation(program, '",
  "1497": "Framebuffer not complete",
  "1498": "gl.bindFramebuffer",
  "1499": "se, 0, 0",
  "1500": "FLOAT, ",
  "1501": "inter",
  "1502": "Se",
  "1503": "(shaderProgram",
  "1504": "DRAW",
  "1505": "right",
  "1506": "ottom",
  "1507": "LE",
  "1508": "error('",
  "1509": " * @returns {WebGL",
  "1510": "sS",
  "1511": "vertex",
  "1512": "Matrix ",
  "1513": "MatrixMultiply",
  "1514": "LogicalMatrix!} b",
  "1515": "this.gl.delete",
  "1516": "Failed to create",
  "1517": "_buffer_",
  "1518": "Buffer | null",
  "1519": "Framebuffer} fbo",
  "1520": ") + '",
  "1521": "',\n      '",
  "1522": "?.addEventListener('click",
  "1523": "text-",
  "1524": ") => {",
  "1525": "', ",
  "1526": "ed",
  "1527": "json",
  "1528": "l().",
  "1529": "sert",
  "1530": "Top",
  "1531": "ordBreak: 'break",
  "1532": "-wrap",
  "1533": "ass",
  "1534": "text = ",
  "1535": "arne",
  "1536": "coded ",
  "1537": "(pair[",
  "1538": "').map(Number",
  "1539": "..",
  "1540": "topPair",
  "1541": "stat",
  "1542": "\n    const ",
  "1543": "for (let i = 0; i < ",
  "1544": "At(0",
  "1545": "c =>",
  "1546": "ids = ",
  "1547": "red ",
  "1548": "> ",
  "1549": "); // ",
  "1550": "(ids",
  "1551": " to ",
  "1552": "ur",
  "1553": "all ",
  "1554": " a ",
  "1555": "frequen",
  "1556": "\\\",\\n  \\\"25\",\n  \"31",
  "1557": "\\\",\\n  \\\"32\",\n  \"25",
  "1558": "\\\",\\n  \\\"33\",\n  \"25",
  "1559": "\\\\n  /**",
  "1560": " {\\n      ",
  "1561": "\\\\\\\\\\\\\\\": \\\\\\\\\\\\\\\"\\\\\\\",\\\\n  \\\\\\\"",
  "1562": "\\\": \\\",",
  "1563": ";\\n  ",
  "1564": "border-radius: 6",
  "1565": "24",
  "1566": "20",
  "1567": "DOCTYPE",
  "1568": "texCoordB",
  "1569": "ds to moving 1 step in",
  "1570": "texCoordA",
  "1571": "texCoord.",
  "1572": "contain",
  "1573": "ampl",
  "1574": "inate",
  "1575": "imageData.data[pixelIndex + 1] = 0; // Green",
  "1576": " * 255",
  "1577": "const intensity = value / ",
  "1578": "channe",
  "1579": "value = values[i]",
  "1580": "TERATIONS",
  "1581": "(gpu.context, matrixSize, matrixSize, '",
  "1582": "ce.now",
  "1583": "` +",
  "1584": "_TO_EDGE",
  "1585": "TER",
  "1586": "ero",
  "1587": "ive",
  "1588": "b.",
  "1589": "Width",
  "1590": "getUniformLocation(program, '",
  "1591": "FRAMEBUFFER",
  "1592": "gl.bindFramebuffer(gl.FRAMEBUFFER, ",
  "1593": "height ",
  "1594": "adPixels(",
  "1595": "alse, 0, 0",
  "1596": "_DRAW",
  "1597": "-right",
  "1598": "// Bottom",
  "1599": "-left",
  "1600": "COMP",
  "1601": "console.error('",
  "1602": " = this.gl.create",
  "1603": "AD",
  "1604": "1.0",
  "1605": "300",
  "1606": "unit ",
  "1607": "message",
  "1608": "fragment",
  "1609": ", c",
  "1610": "(a, b, c",
  "1611": "ecute",
  "1612": "initialize",
  "1613": "color_buffer_",
  "1614": "sion ",
  "1615": "e<",
  "1616": "WebGLBuffer | null",
  "1617": "this.gl = ",
  "1618": ", fbo",
  "1619": "gl, fbo",
  "1620": "WebGLFramebuffer} fbo",
  "1621": "sl",
  "1622": "await ",
  "1623": ".clipboard",
  "1624": "cop",
  "1625": "Button?.addEventListener('click",
  "1626": "y-json",
  "1627": "DisplayTokenization",
  "1628": "ell().",
  "1629": ".insert",
  "1630": "wordBreak: 'break",
  "1631": "pre-wrap",
  "1632": "pace",
  "1633": "',\n    ",
  "1634": "Content",
  "1635": " ${",
  "1636": ":</",
  "1637": "per",
  "1638": "inal",
  "1639": "orig",
  "1640": "result",
  "1641": "d the ",
  "1642": "arCodeAt(0",
  "1643": "(text, c =>",
  "1644": "ize ",
  "1645": "new",
  "1646": "pair, idx",
  "1647": " wi",
  "1648": "e the ",
  "1649": "cur",
  "1650": "coun",
  "1651": ".\n",
  "1652": "sequence of token ID",
  "1653": " se",
  "1654": "px;\\n      \",\n  \"26",
  "1655": "\\\\n'",
  "1656": ">\\n",
  "1657": ">\\n    ",
  "1658": "\\\\n        ",
  "1659": "\\\\\\\\n\\\\\\\\n",
  "1660": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n",
  "1661": "\\n  /**\\n   * ",
  "1662": "\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\n    ",
  "1663": "}\\\\n",
  "1664": ");\\n      ",
  "1665": "\\n   */\\n  ",
  "1666": "\\\": \\\": ",
  "1667": "</button",
  "1668": ": 100%",
  "1669": "width: 100%",
  "1670": "f2",
  "1671": "-s",
  "1672": " id=\"",
  "1673": "64",
  "1674": ": 1px solid #",
  "1675": "border: 1px solid #",
  "1676": "ily",
  "1677": "lex",
  "1678": ">\n  <",
  "1679": ">\n",
  "1680": "!DOCTYPE",
  "1681": " / float(",
  "1682": "responds to moving 1 step in",
  "1683": " contain",
  "1684": "er2D",
  "1685": "ordinate",
  "1686": "lu",
  "1687": "intensity * 255",
  "1688": "channel",
  "1689": "values.length",
  "1690": "Canvas",
  "1691": "Multiplication",
  "1692": "ITERATIONS",
  "1693": "LogicalMatrix(gpu.context, matrixSize, matrixSize, '",
  "1694": "nce.now",
  "1695": "MP_TO_EDGE",
  "1696": ", gl.NEAREST",
  "1697": "TER, gl.NEAREST",
  "1698": "zero",
  "1699": " = this._createFloat",
  "1700": "':",
  "1701": "bindTexture",
  "1702": "(gl.TEXTURE",
  "1703": "ract",
  "1704": "gl = this.context.",
  "1705": "ight",
  "1706": " = gl.getUniformLocation(program, '",
  "1707": "context ",
  "1708": "Context!} ",
  "1709": " for ",
  "1710": "LETE",
  "1711": "gl.FRAMEBUFFER",
  "1712": "false, 0, 0",
  "1713": "(shaderProgram, '",
  "1714": "C_DRAW",
  "1715": "ATI",
  "1716": "// Top",
  "1717": " comp",
  "1718": "S)",
  "1719": ";\n    const ",
  "1720": "in(",
  "1721": ";\n        ",
  "1722": ".innerText",
  "1723": "execute",
  "1724": "Texture(",
  "1725": ".');\n    }\n    ",
  "1726": "_color_buffer_",
  "1727": "up",
  "1728": "ser",
  "1729": "canvas.",
  "1730": "ise<",
  "1731": "Position",
  "1732": "/** @type {WebGLBuffer | null",
  "1733": "fined",
  "1734": "od ",
  "1735": "} gl",
  "1736": "ender",
  "1737": "cul",
  "1738": "place ",
  "1739": "glsl",
  "1740": "or.clipboard",
  "1741": "Button?.addEventListener('click', ",
  "1742": "of the ",
  "1743": "ndDisplayTokenization",
  "1744": "cess",
  "1745": "Cell().",
  "1746": "table",
  "1747": "f9f9",
  "1748": "ddd",
  "1749": "assign",
  "1750": "bject",
  "1751": ");\n\n  const ",
  "1752": "strong> ${",
  "1753": " = document.createElement('p",
  "1754": "title",
  "1755": ");\n\n  // ",
  "1756": "vi",
  "1757": ") return",
  "1758": "De",
  "1759": "learne",
  "1760": ",').map(Number",
  "1761": "(',').map(Number",
  "1762": "int ",
  "1763": "256",
  "1764": "charCodeAt(0",
  "1765": ".from(text, c =>",
  "1766": "vocabulary ",
  "1767": "train",
  "1768": " on",
  "1769": "=== ",
  "1770": "ter ",
  "1771": "s.length",
  "1772": "count",
  "1773": ") {\n  const ",
  "1774": " from",
  "1775": "ids ",
  "1776": "t pair",
  "1777": "min-height: 100vh\",\n  \"32",
  "1778": ";\\n      min-height: 100vh\",\n  \"32",
  "1779": "<body>\\n  <\",\n  \"32",
  "1780": "\\\": \\\"\\\\u001\",\n  \"32",
  "1781": "\\\",\\n  \\\"25\",\n  \"25",
  "1782": "\\\",\\n  \\\"31\",\n  \"25",
  "1783": "\\\\r",
  "1784": "\\\\\\\": \\\\\\\"\\\",\\n  \\\"6\",\n  \"200",
  "1785": "throw new Error('Framebuffer not complete",
  "1786": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\",
  "1787": "\\\\n  /**\\\\n  ",
  "1788": "\\\\\\\\n  <",
  "1789": "\\\",\\n  \\\"300",
  "1790": ";\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\n      ",
  "1791": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\"",
  "1792": ") {\\n    const ",
  "1793": ");\\\\\\\\n    ",
  "1794": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\",",
  "1795": "}\\n\\n    ",
  "1796": "\\\\\\\",\\\\n  \\\\\\\"30",
  "1797": "\\\": \\\", ",
  "1798": "\\\\\\\",\\\\n  \\\\\\\"29",
  "1799": "1\\\": \\\"\",\n  \"7",
  "1800": "6\\\": \\\"\",\n  \"7",
  "1801": "19",
  "1802": "8\\\": \\\"\",\n  \"6",
  "1803": "\\\",\\n  \\\"21",
  "1804": "#output-container ",
  "1805": "border-box",
  "1806": "</body>",
  "1807": "izing",
  "1808": "</style",
  "1809": "0, 0.",
  "1810": ": 10",
  "1811": "55",
  "1812": "amily",
  "1813": "33",
  "1814": "flex",
  "1815": "<head>",
  "1816": "<!DOCTYPE",
  "1817": "vec2(",
  "1818": "orresponds to moving 1 step in",
  "1819": " c",
  "1820": "pute",
  "1821": "utput ",
  "1822": "B_height",
  "1823": "uniform in",
  "1824": "Texture contain",
  "1825": "ampler2D",
  "1826": "coordinate",
  "1827": "or(intensity * 255",
  "1828": "ToCanvas",
  "1829": "ed(",
  "1830": "Matrix Multiplication",
  "1831": "`<p>",
  "1832": "Secon",
  "1833": "putation",
  "1834": "_ITERATIONS",
  "1835": " = new LogicalMatrix(gpu.context, matrixSize, matrixSize, '",
  "1836": "mance.now",
  "1837": "Math.random()",
  "1838": "AMP_TO_EDGE",
  "1839": "LTER, gl.NEAREST",
  "1840": "(this._create",
  "1841": "texture = this._createFloat",
  "1842": "bindTexture(gl.TEXTURE_2D, ",
  "1843": "Texture(gl.TEXTURE",
  "1844": "pract",
  "1845": "\n    // ",
  "1846": "wpor",
  "1847": "ote",
  "1848": "gl = this.context.gl",
  "1849": "B_width",
  "1850": "A_height",
  "1851": "eight",
  "1852": "Loc = gl.getUniformLocation(program, '",
  "1853": "Context!} context ",
  "1854": "COMPLETE",
  "1855": "== gl.FRAMEBUFFER",
  "1856": "(gl.FRAMEBUFFER",
  "1857": "BO",
  "1858": "gl.bindFramebuffer(gl.FRAMEBUFFER, fbo",
  "1859": " * @returns {Float32Array",
  "1860": "FLOAT, false, 0, 0",
  "1861": "ation(shaderProgram, '",
  "1862": "sAttribLoc",
  "1863": "ATIC_DRAW",
  "1864": "Buffer(",
  "1865": "1.0, 0.0, // Bottom",
  "1866": "([",
  "1867": "type",
  "1868": "pQuad",
  "1869": "', this.gl.",
  "1870": "TUS)",
  "1871": "_ST",
  "1872": "Shader(program",
  "1873": "ADER",
  "1874": "_S",
  "1875": "main(",
  "1876": "sion 300",
  "1877": "sSource",
  "1878": "\n   */\n  _create",
  "1879": " shader",
  "1880": "stand",
  "1881": "div.innerText",
  "1882": "Info(",
  "1883": "Program(this.",
  "1884": "****************",
  "1885": ");\n    if (!",
  "1886": "T_color_buffer_",
  "1887": "nder",
  "1888": "our",
  "1889": "romise<",
  "1890": " = null",
  "1891": "/** @type {WebGLBuffer | null} */",
  "1892": "defined",
  "1893": "context = ",
  "1894": "ste",
  "1895": "async ",
  "1896": "Gpu",
  "1897": ";\n    this.",
  "1898": "Context} gl",
  "1899": "Render",
  "1900": "\n  /**\n   * \n   * @param {",
  "1901": "alcul",
  "1902": " with",
  "1903": "place all ",
  "1904": "ment.glsl",
  "1905": "multipl",
  "1906": ".js',\n      '",
  "1907": "roject",
  "1908": "ator.clipboard",
  "1909": "av",
  "1910": "ment = ",
  "1911": "async",
  "1912": "(vocabJson",
  "1913": "), ",
  "1914": "or ",
  "1915": "AndDisplayTokenization",
  "1916": ".insertCell().",
  "1917": "th>",
  "1918": ": 'pre-wrap",
  "1919": "pace: 'pre-wrap",
  "1920": "white",
  "1921": "lor",
  "1922": "ing to ",
  "1923": "ContentDiv",
  "1924": "Vocabular",
  "1925": ":</strong> ${",
  "1926": "`<strong>",
  "1927": "P = document.createElement('p",
  "1928": ";\n  outputDiv.appendChild(",
  "1929": "ure ",
  "1930": "original",
  "1931": "s(tokenizer",
  "1932": "encodedId",
  "1933": "the",
  "1934": "it(',').map(Number",
  "1935": "in ",
  "1936": "es()",
  "1937": "try",
  "1938": "st ",
  "1939": ". ",
  "1940": "ity",
  "1941": "cter",
  "1942": "c.charCodeAt(0",
  "1943": "Array.from(text, c =>",
  "1944": "vocab_size",
  "1945": " size",
  "1946": "final",
  "1947": ".\n   * @param {",
  "1948": "} el",
  "1949": "sh",
  "1950": "&&",
  "1951": "newId",
  "1952": ", pair, idx",
  "1953": "(ids, pair, idx",
  "1954": "merg",
  "1955": "number} ",
  "1956": "ren",
  "1957": "Mer",
  "1958": "set(",
  "1959": "}`",
  "1960": " */\n",
  "1961": "98",
  "1962": "- The sequence of token ID",
  "1963": "\n * ",
  "1964": "/**\n * ",
  "1965": "\\\\r\",\n  \"34",
  "1966": "\\n    \",\n  \"34",
  "1967": " \",\n  \"34",
  "1968": "align-items: center;\\n      min-height: 100vh\",\n  \"32",
  "1969": "\\n\\n<body>\\n  <\",\n  \"32",
  "1970": "4\\\": \\\"",
  "1971": "\\\\n    \",\n  \"31",
  "1972": " \",\n  \"29",
  "1973": "\\\\n    const ",
  "1974": "<body>\\\\n  <",
  "1975": ";\\\\n      min-height: 100vh",
  "1976": " id=\\\"",
  "1977": "\\\\n  /**\\\\n   * ",
  "1978": "\\\\\\\\r",
  "1979": ";\\\\n      \\\",\\n  \\\"2",
  "1980": ";\\\\n  ",
  "1981": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\",
  "1982": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\": ",
  "1983": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n",
  "1984": "\\\\\\\\n  /**",
  "1985": "\\\\\\\\n'",
  "1986": "\\n    const ",
  "1987": "\\n      '",
  "1988": " */\\\\n  ",
  "1989": ");\\\\n    this.gl.",
  "1990": "\\\\\\\": \\\\\\\",",
  "1991": "\\\\\\\\\\\\\\\\n",
  "1992": ";\\\\\\\\n    ",
  "1993": ");\\\\n    gl.",
  "1994": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\": \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\"",
  "1995": ") {\\\\n      ",
  "1996": "}\\n\\n",
  "1997": "');\\n  ",
  "1998": "\\\\\\\",\\\\n  \\\\\\\"34",
  "1999": ";\\n",
  "2000": "\\\\\\\",\\\\n  \\\\\\\"31",
  "2001": "2\\\": \\\"\",\n  \"7",
  "2002": "3\\\": \\\"\",\n  \"7",
  "2003": "7\\\": \\\"\",\n  \"7",
  "2004": "9\\\": \\\"\",\n  \"7",
  "2005": "7\\\": \\\"\",\n  \"6",
  "2006": "0\\\": \\\"\",\n  \"6",
  "2007": "\\\",\\n  \\\"24",
  "2008": "apse",
  "2009": "margin-top",
  "2010": "border: 1px solid #ddd",
  "2011": "area",
  "2012": "bottom",
  "2013": "font-size",
  "2014": "text-align",
  "2015": "box-s",
  "2016": ";\n      padding",
  "2017": "0, 0, 0, 0.",
  "2018": "ba",
  "2019": "family",
  "2020": "over",
  "2021": ": 0",
  "2022": ".js\"",
  "2023": "script src=\"",
  "2024": "<!DOCTYPE ",
  "2025": ") / float(",
  "2026": " = vec2(",
  "2027": "ction for ",
  "2028": "dire",
  "2029": "k (",
  "2030": " corresponds to moving 1 step in",
  "2031": "t(texCoord.",
  "2032": "compute",
  "2033": "uniform int ",
  "2034": "; // Texture contain",
  "2035": " sampler2D",
  "2036": "lue",
  "2037": "floor(intensity * 255",
  "2038": "e values",
  "2039": "as ",
  "2040": "if (value ",
  "2041": "values.length; i++",
  "2042": "ctx",
  "2043": "32ToCanvas",
  "2044": "ixed(",
  "2045": "WebGL Matrix Multiplication",
  "2046": "erSecon",
  "2047": "adPixels(c",
  "2048": "mads",
  "2049": "M_ITERATIONS",
  "2050": "formance.now",
  "2051": "Time = ",
  "2052": "art",
  "2053": "mension",
  "2054": ") - Math.random()",
  "2055": "LAMP_TO_EDGE",
  "2056": "RAP",
  "2057": "ILTER, gl.NEAREST",
  "2058": " = texture",
  "2059": "Ident",
  "2060": "andom",
  "2061": "Texture(this._create",
  "2062": "uniform1i(this.matrix",
  "2063": "iveTexture(gl.TEXTURE",
  "2064": "od pract",
  "2065": "ewpor",
  "2066": "Note",
  "2067": "Loc, ",
  "2068": "_COMPLETE",
  "2069": "!== gl.FRAMEBUFFER",
  "2070": "Status(gl.FRAMEBUFFER",
  "2071": "FBO",
  "2072": ".\n    ",
  "2073": "PU",
  "2074": "texAttribLoc",
  "2075": "Pointer",
  "2076": "vertexAttrib",
  "2077": "AttribLocation(shaderProgram, '",
  "2078": "posAttribLoc",
  "2079": "STATIC_DRAW",
  "2080": "bufferData",
  "2081": " = this.gl.createBuffer(",
  "2082": " = new Float32Array([",
  "2083": "ilation",
  "2084": "tupQuad",
  "2085": ":', this.gl.",
  "2086": "ATUS)",
  "2087": "attachShader(program",
  "2088": "HADER",
  "2089": ");\n        ",
  "2090": "vec4",
  "2091": "void ",
  "2092": "aTexCoord",
  "2093": "Pos",
  "2094": "version 300",
  "2095": "(div.innerText",
  "2096": "logInfo(",
  "2097": "context, ",
  "2098": "this.mm_program",
  "2099": "LogicalMatrix!} a ",
  "2100": "XT_color_buffer_",
  "2101": "float texture",
  "2102": "render",
  "2103": "uppor",
  "2104": "rowser",
  "2105": "Context('",
  "2106": "Promise<",
  "2107": "undefined",
  "2108": "me",
  "2109": "\n   */\n  constructor(",
  "2110": "ingContext} gl",
  "2111": "2Render",
  "2112": "g, '",
  "2113": "\\r",
  "2114": "fragment.glsl",
  "2115": "Project",
  "2116": "ard ",
  "2117": "igator.clipboard",
  "2118": "lement ",
  "2119": " () => {",
  "2120": "Button?.addEventListener('click', async",
  "2121": "value",
  "2122": "Button = document.getElementById('",
  "2123": "Json(vocabJson",
  "2124": "cessAndDisplayTokenization",
  "2125": "tr.insertCell().",
  "2126": "tbody",
  "2127": "vocabT",
  "2128": "margin",
  "2129": "Space: 'pre-wrap",
  "2130": "Color",
  "2131": "fe2",
  "2132": ", {",
  "2133": "style, {",
  "2134": "assign(",
  "2135": "Object",
  "2136": "read",
  "2137": "decodedContentDiv",
  "2138": "ection",
  "2139": ".innerHTML = `<strong>",
  "2140": "textContent = '",
  "2141": ".innerHTML = '",
  "2142": "efo",
  "2143": "outputDiv) return",
  "2144": "Results(tokenizer",
  "2145": "page",
  "2146": " of ",
  "2147": "for (const ",
  "2148": ");\n\n    // ",
  "2149": "s a ",
  "2150": "this.vocab.get",
  "2151": "as(pair[",
  "2152": "| !",
  "2153": "Sto",
  "2154": ");\n      const ",
  "2155": "plit(',').map(Number",
  "2156": ") {\n        ",
  "2157": "[1]",
  "2158": "ries()",
  "2159": "Entry",
  "2160": "ind the ",
  "2161": "frequent pair",
  "2162": "most ",
  "2163": "racter",
  "2164": "c.charCodeAt(0)",
  "2165": "ids = Array.from(text, c =>",
  "2166": "F-",
  "2167": "ired ",
  "2168": "size ",
  "2169": "}\n\n  /**\n   * ",
  "2170": "this.merge",
  "2171": "PETokenizer",
  "2172": "} else",
  "2173": " += ",
  "2174": "push",
  "2175": " === ",
  "2176": " ids",
  "2177": "s = ",
  "2178": "merge(ids, pair, idx",
  "2179": "curren",
  "2180": " + 1]",
  "2181": " ids.length",
  "2182": "Map(",
  "2183": "Stats(",
  "2184": " */\nfunction ",
  "2185": "g.",
  "2186": "Map<",
  "2187": "ids - The sequence of token ID",
  "2188": "s.\n",
  "2189": "\\n  const \",\n  \"34",
  "2190": "allJsContent = allJsContent.replace(/\\\\r\",\n  \"34",
  "2191": ";\\n    \",\n  \"34",
  "2192": "\\\\n';\\n    \",\n  \"34",
  "2193": "imageData.data[pixelIndex + 2\",\n  \"33",
  "2194": "\\n      imageData.data[pixelIndex + 2\",\n  \"33",
  "2195": ";\\n      align-items: center;\\n      min-height: 100vh\",\n  \"32",
  "2196": "</head>\\n\\n<body>\\n  <\",\n  \"32",
  "2197": "\\\",\\n  \\\"21\",\n  \"31",
  "2198": "<\",\n  \"31",
  "2199": "\\\\\\\",\\\\n  \\\\\\\"32\\\",\\n  \\\"30\",\n  \"30",
  "2200": "\\\",\\n  \\\"33\",\n  \"29",
  "2201": "\\\",\\n  \\\"3\",\n  \"26",
  "2202": "break;\\n      ",
  "2203": "\\\">",
  "2204": "throw new Error('Failed to create",
  "2205": "\\\",\\n  \\\"32\",\n  \"21",
  "2206": ");\\n        ",
  "2207": "script src=\\\"",
  "2208": ".js\\\"",
  "2209": "\\\\\\\\\\\\\\\": \\\\\\\\\\\\\\\",",
  "2210": ";\\\\\\\\n      min-height: 100vh",
  "2211": "<body>\\\\\\\\n  <",
  "2212": "\\\\n\\\\n<body>\\\\n  <",
  "2213": "align-items: center;\\\\n      min-height: 100vh",
  "2214": "\\n * ",
  "2215": "\\\\\\\\n  /**\\\\\\\\n  ",
  "2216": "\\\",\\n  \\\"32\",\n  \"17",
  "2217": "\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\",\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\n  \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\"3",
  "2218": "\\\\n   */\\\\n  ",
  "2219": "\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\r\\\\\\\\\\\\\\\\n",
  "2220": ">\\\\n    ",
  "2221": ">\\\\n",
  "2222": ";\\\\n      \\\",\\n  \\\"26",
  "2223": "\\\\\\\",\\\\n  \\\\\\\"33\\\",\\n  \\\"300",
  "2224": ".\\n",
  "2225": "',\\n    ",
  "2226": " {\\\\n      ",
  "2227": "',\\n      '",
