{
  "0": "\u0000",
  "1": "\u0001",
  "2": "\u0002",
  "3": "\u0003",
  "4": "\u0004",
  "5": "\u0005",
  "6": "\u0006",
  "7": "\u0007",
  "8": "\b",
  "9": "\t",
  "10": "\n",
  "11": "\u000b",
  "12": "\f",
  "13": "\r",
  "14": "\u000e",
  "15": "\u000f",
  "16": "\u0010",
  "17": "\u0011",
  "18": "\u0012",
  "19": "\u0013",
  "20": "\u0014",
  "21": "\u0015",
  "22": "\u0016",
  "23": "\u0017",
  "24": "\u0018",
  "25": "\u0019",
  "26": "\u001a",
  "27": "\u001b",
  "28": "\u001c",
  "29": "\u001d",
  "30": "\u001e",
  "31": "\u001f",
  "32": " ",
  "33": "!",
  "34": "\"",
  "35": "#",
  "36": "$",
  "37": "%",
  "38": "&",
  "39": "'",
  "40": "(",
  "41": ")",
  "42": "*",
  "43": "+",
  "44": ",",
  "45": "-",
  "46": ".",
  "47": "/",
  "48": "0",
  "49": "1",
  "50": "2",
  "51": "3",
  "52": "4",
  "53": "5",
  "54": "6",
  "55": "7",
  "56": "8",
  "57": "9",
  "58": ":",
  "59": ";",
  "60": "<",
  "61": "=",
  "62": ">",
  "63": "?",
  "64": "@",
  "65": "A",
  "66": "B",
  "67": "C",
  "68": "D",
  "69": "E",
  "70": "F",
  "71": "G",
  "72": "H",
  "73": "I",
  "74": "J",
  "75": "K",
  "76": "L",
  "77": "M",
  "78": "N",
  "79": "O",
  "80": "P",
  "81": "Q",
  "82": "R",
  "83": "S",
  "84": "T",
  "85": "U",
  "86": "V",
  "87": "W",
  "88": "X",
  "89": "Y",
  "90": "Z",
  "91": "[",
  "92": "\\",
  "93": "]",
  "94": "^",
  "95": "_",
  "96": "`",
  "97": "a",
  "98": "b",
  "99": "c",
  "100": "d",
  "101": "e",
  "102": "f",
  "103": "g",
  "104": "h",
  "105": "i",
  "106": "j",
  "107": "k",
  "108": "l",
  "109": "m",
  "110": "n",
  "111": "o",
  "112": "p",
  "113": "q",
  "114": "r",
  "115": "s",
  "116": "t",
  "117": "u",
  "118": "v",
  "119": "w",
  "120": "x",
  "121": "y",
  "122": "z",
  "123": "{",
  "124": "|",
  "125": "}",
  "126": "~",
  "127": "",
  "128": "",
  "129": "",
  "130": "",
  "131": "",
  "132": "",
  "133": "",
  "134": "",
  "135": "",
  "136": "",
  "137": "",
  "138": "",
  "139": "",
  "140": "",
  "141": "",
  "142": "",
  "143": "",
  "144": "",
  "145": "",
  "146": "",
  "147": "",
  "148": "",
  "149": "",
  "150": "",
  "151": "",
  "152": "",
  "153": "",
  "154": "",
  "155": "",
  "156": "",
  "157": "",
  "158": "",
  "159": "",
  "160": " ",
  "161": "¡",
  "162": "¢",
  "163": "£",
  "164": "¤",
  "165": "¥",
  "166": "¦",
  "167": "§",
  "168": "¨",
  "169": "©",
  "170": "ª",
  "171": "«",
  "172": "¬",
  "173": "­",
  "174": "®",
  "175": "¯",
  "176": "°",
  "177": "±",
  "178": "²",
  "179": "³",
  "180": "´",
  "181": "µ",
  "182": "¶",
  "183": "·",
  "184": "¸",
  "185": "¹",
  "186": "º",
  "187": "»",
  "188": "¼",
  "189": "½",
  "190": "¾",
  "191": "¿",
  "192": "À",
  "193": "Á",
  "194": "Â",
  "195": "Ã",
  "196": "Ä",
  "197": "Å",
  "198": "Æ",
  "199": "Ç",
  "200": "È",
  "201": "É",
  "202": "Ê",
  "203": "Ë",
  "204": "Ì",
  "205": "Í",
  "206": "Î",
  "207": "Ï",
  "208": "Ð",
  "209": "Ñ",
  "210": "Ò",
  "211": "Ó",
  "212": "Ô",
  "213": "Õ",
  "214": "Ö",
  "215": "×",
  "216": "Ø",
  "217": "Ù",
  "218": "Ú",
  "219": "Û",
  "220": "Ü",
  "221": "Ý",
  "222": "Þ",
  "223": "ß",
  "224": "à",
  "225": "á",
  "226": "â",
  "227": "ã",
  "228": "ä",
  "229": "å",
  "230": "æ",
  "231": "ç",
  "232": "è",
  "233": "é",
  "234": "ê",
  "235": "ë",
  "236": "ì",
  "237": "í",
  "238": "î",
  "239": "ï",
  "240": "ð",
  "241": "ñ",
  "242": "ò",
  "243": "ó",
  "244": "ô",
  "245": "õ",
  "246": "ö",
  "247": "÷",
  "248": "ø",
  "249": "ù",
  "250": "ú",
  "251": "û",
  "252": "ü",
  "253": "ý",
  "254": "þ",
  "255": "ÿ",
  "256": "  ",
  "257": "\n  ",
  "258": "\n    ",
  "259": "on",
  "260": "te",
  "261": "th",
  "262": "t ",
  "263": ";\n    ",
  "264": "er",
  "265": "re",
  "266": ", ",
  "267": "in",
  "268": "en",
  "269": "= ",
  "270": "at",
  "271": "e ",
  "272": "or",
  "273": "ra",
  "274": "is",
  "275": "tex",
  "276": " {",
  "277": "gl",
  "278": "con",
  "279": " = ",
  "280": "this",
  "281": " *",
  "282": "this.",
  "283": "gl.",
  "284": "le",
  "285": "id",
  "286": "ro",
  "287": ");\n    ",
  "288": "ram",
  "289": "\n      ",
  "290": "cons",
  "291": "**",
  "292": "/ ",
  "293": "oc",
  "294": "al",
  "295": "ri",
  "296": "to",
  "297": "ad",
  "298": "text",
  "299": ": ",
  "300": "const ",
  "301": ");",
  "302": " * ",
  "303": "// ",
  "304": "co",
  "305": "ut",
  "306": "iz",
  "307": ") {",
  "308": "pa",
  "309": "s ",
  "310": "de",
  "311": ";\n      ",
  "312": "ent",
  "313": "ab",
  "314": "ion",
  "315": "d ",
  "316": "the ",
  "317": "ge",
  "318": "ure",
  "319": "ment",
  "320": "ig",
  "321": "\n   * ",
  "322": "}\n",
  "323": "ing",
  "324": "atri",
  "325": "rea",
  "326": "for",
  "327": " (",
  "328": "atrix",
  "329": "ul",
  "330": "st",
  "331": "ne",
  "332": "w ",
  "333": "idth",
  "334": "gram",
  "335": "rogram",
  "336": "an",
  "337": "he",
  "338": "ord",
  "339": "it",
  "340": "ur",
  "341": "} ",
  "342": "ocab",
  "343": "ken",
  "344": "width",
  "345": "lo",
  "346": "('",
  "347": "iv",
  "348": "this.gl.",
  "349": "ar",
  "350": "un",
  "351": "reate",
  "352": "ht",
  "353": "bo",
  "354": "create",
  "355": "vocab",
  "356": "as",
  "357": "0, ",
  "358": "ff",
  "359": "ex",
  "360": "\n   * @",
  "361": "pl",
  "362": "had",
  "363": "</",
  "364": "ata",
  "365": "hader",
  "366": ");\n",
  "367": ");\n  ",
  "368": "/**",
  "369": "heig",
  "370": "ffer",
  "371": "uffer",
  "372": "ten",
  "373": "keniz",
  "374": "ct",
  "375": "ram {",
  "376": "param {",
  "377": "texture",
  "378": "px",
  "379": "Co",
  "380": "if",
  "381": "new ",
  "382": " */",
  "383": "ir",
  "384": "es",
  "385": "program",
  "386": " the ",
  "387": "; ",
  "388": "matrix",
  "389": "Tex",
  "390": "ic",
  "391": ") ",
  "392": "urn",
  "393": "turn",
  "394": "return",
  "395": "put",
  "396": "code",
  "397": "ation",
  "398": ") {\n      ",
  "399": ") {\n    ",
  "400": "to ",
  "401": "eb",
  "402": ";\n  ",
  "403": "str",
  "404": "qu",
  "405": "Con",
  "406": "pu",
  "407": "ma",
  "408": " s",
  "409": "****",
  "410": "alu",
  "411": "\n   * @param {",
  "412": "if (",
  "413": "pair",
  "414": "height",
  "415": "loat",
  "416": "Coord",
  "417": "lement",
  "418": ");\n      ",
  "419": "get",
  "420": "0.",
  "421": "um",
  "422": "ac",
  "423": "\n  /**",
  "424": "tokeniz",
  "425": "\n  const ",
  "426": "TE",
  "427": "out",
  "428": "t = ",
  "429": "ize",
  "430": "el",
  "431": "y ",
  "432": "Text",
  "433": "ment.",
  "434": "output",
  "435": " */\n  ",
  "436": "\n   */\n  ",
  "437": "ter",
  "438": "Loc",
  "439": "Matrix",
  "440": "ult",
  "441": "');\n    ",
  "442": "tr",
  "443": "s.",
  "444": "RA",
  "445": "Element",
  "446": "ument.",
  "447": "ocument.",
  "448": "document.",
  "449": "ec",
  "450": " +",
  "451": "a ",
  "452": "px;\n      ",
  "453": "=\"",
  "454": "RE",
  "455": "texCoord",
  "456": "form",
  "457": "us",
  "458": "Conten",
  "459": "In",
  "460": "ing ",
  "461": "il",
  "462": "ap",
  "463": ": 1",
  "464": "data",
  "465": "Shader",
  "466": "col",
  "467": "ton",
  "468": "utton",
  "469": "');\n  ",
  "470": "os",
  "471": "1.",
  "472": "(gl.",
  "473": "Data",
  "474": "TU",
  "475": "fbo",
  "476": "Js",
  "477": "Div",
  "478": "}\n\n    ",
  "479": "To",
  "480": "Id",
  "481": ";\n",
  "482": "- ",
  "483": "ber",
  "484": "umber",
  "485": "ix",
  "486": "TEX",
  "487": "ER",
  "488": "Program",
  "489": "Texture",
  "490": "anv",
  "491": "Buffer",
  "492": "GL",
  "493": "valu",
  "494": "js",
  "495": "div",
  "496": "coded",
  "497": "se",
  "498": "of",
  "499": "\">",
  "500": "iform",
  "501": "TURE",
  "502": "TEXTURE",
  "503": "00",
  "504": "anvas",
  "505": "Lo",
  "506": "',",
  "507": "}\n\n  /**",
  "508": "let ",
  "509": "string",
  "510": "number",
  "511": "2D",
  "512": ");\n    gl.",
  "513": "ixel",
  "514": "ror",
  "515": "ebGL",
  "516": "WebGL",
  "517": "context",
  "518": "Log",
  "519": "e = ",
  "520": "order",
  "521": "ray",
  "522": " = 0",
  "523": "ids",
  "524": "Th",
  "525": "\n * ",
  "526": "\n\n",
  "527": "TEXTURE_",
  "528": "FER",
  "529": "FFER",
  "530": "UFFER",
  "531": "BUFFER",
  "532": "com",
  "533": "vec",
  "534": "ver",
  "535": "shader",
  "536": "_create",
  "537": "}\n    ",
  "538": "canvas",
  "539": "border",
  "540": "ical",
  "541": " = document.",
  "542": "outputDiv",
  "543": "row ",
  "544": "\n        ",
  "545": "if (!",
  "546": "rray",
  "547": "Array",
  "548": "and ",
  "549": "tokenizer",
  "550": "mer",
  "551": "; i",
  "552": "ion ",
  "553": "\n  <",
  "554": "p>",
  "555": "A_",
  "556": "32",
  "557": "Float",
  "558": "(this.",
  "559": "do",
  "560": "float",
  "561": "ebuffer",
  "562": "ramebuffer",
  "563": "sc",
  "564": "it ",
  "565": ";\n    }\n\n    ",
  "566": "button",
  "567": "tri",
  "568": "; // ",
  "569": "end",
  "570": "\n  // ",
  "571": "ain",
  "572": "throw ",
  "573": " n",
  "574": "\n    // ",
  "575": "At",
  "576": "ch",
  "577": "ular",
  "578": "cl",
  "579": "ce",
  "580": " = new ",
  "581": "quen",
  "582": " {\n      ",
  "583": "trib",
  "584": ");\n    this.gl.",
  "585": "ME",
  "586": "********",
  "587": "icalMatrix",
  "588": "LogicalMatrix",
  "589": "color",
  "590": "our",
  "591": "ror('",
  "592": "for ",
  "593": "rag",
  "594": "frag",
  "595": "ull",
  "596": "d(",
  "597": ".in",
  "598": "add",
  "599": "tain",
  "600": "contain",
  "601": "pla",
  "602": "ispla",
  "603": "ial",
  "604": "Pa",
  "605": "im",
  "606": "}\n\n",
  "607": "}\n  ",
  "608": "${",
  "609": ") {\n    const ",
  "610": " <",
  "611": "for (",
  "612": "s {",
  "613": "returns {",
  "614": "The ",
  "615": "ce ",
  "616": "of ",
  "617": "mage",
  "618": "uniform",
  "619": "pixel",
  "620": "Attrib",
  "621": "bin",
  "622": "1.0, ",
  "623": "(program",
  "624": " = this.",
  "625": "!} ",
  "626": "Er",
  "627": "new Er",
  "628": "throw new Er",
  "629": "quad",
  "630": ", '",
  "631": "rip",
  "632": "scrip",
  "633": "ipl",
  "634": "ultipl",
  "635": "gpu",
  "636": "Json",
  "637": "Element('",
  "638": "createElement('",
  "639": "isplay",
  "640": "ack",
  "641": "back",
  "642": "itial",
  "643": "id ",
  "644": "> ",
  "645": "all",
  "646": "return ",
  "647": " + ",
  "648": "in ",
  "649": "mageData",
  "650": "Valu",
  "651": "dom",
  "652": ".width",
  "653": "B_",
  "654": "2D, ",
  "655": "TEXTURE_2D, ",
  "656": "BUFFER, ",
  "657": "bind",
  "658": "0.0, ",
  "659": "vec2",
  "660": "throw new Error('",
  "661": ".js",
  "662": "ile",
  "663": "dy",
  "664": "body",
  "665": "und",
  "666": "ect",
  "667": "app",
  "668": "fo",
  "669": "container",
  "670": "res",
  "671": "\n   * @returns {",
  "672": ").",
  "673": "\n    const ",
  "674": "Ch",
  "675": "yp",
  "676": "typ",
  "677": "Tokeniz",
  "678": "e {",
  "679": "merge",
  "680": "1]",
  "681": "++",
  "682": " < ",
  "683": "rom",
  "684": "ID",
  "685": "token",
  "686": "\n    <",
  "687": "float(",
  "688": "32Array",
  "689": "Float32Array",
  "690": "comp",
  "691": ", this.gl.",
  "692": "FRA",
  "693": "flo",
  "694": ") {\n      throw new Error('",
  "695": "osit",
  "696": "Framebuffer",
  "697": "ot ",
  "698": ".');\n    ",
  "699": "round",
  "700": "ground",
  "701": "background",
  "702": ": '",
  "703": "gin",
  "704": "ild(",
  "705": "Child(",
  "706": "endChild(",
  "707": "appendChild(",
  "708": ".appendChild(",
  "709": "HT",
  "710": "ner",
  "711": ".inner",
  "712": "top",
  "713": "25",
  "714": "initial",
  "715": "vocabular",
  "716": "text ",
  "717": "En",
  "718": "s(",
  "719": "ction ",
  "720": "\n * @",
  "721": ": #",
  "722": ">\n  <",
  "723": ">\n",
  "724": "imageData",
  "725": "matrixS",
  "726": "data[",
  "727": "ran",
  "728": "(gl.TEXTURE_2D, ",
  "729": "ate",
  "730": "FRAME",
  "731": "heigh",
  "732": "\n   * @param {LogicalMatrix",
  "733": "lete",
  "734": "dex",
  "735": "mm",
  "736": "\n      '",
  "737": "wa",
  "738": "men",
  "739": "tokenize",
  "740": "ON",
  "741": "ess",
  "742": "argin",
  "743": "margin",
  "744": "dd",
  "745": "ol",
  "746": "ject",
  "747": " = document.createElement('",
  "748": "Content = ",
  "749": "itle",
  "750": "pro",
  "751": "decoded",
  "752": "ML",
  "753": "HTML",
  "754": "-container",
  "755": "output-container",
  "756": "encoded",
  "757": "ation ",
  "758": "reak",
  "759": "vocab.",
  "760": "(text",
  "761": "inal",
  "762": "}\n\n  /**\n   * ",
  "763": " // ",
  "764": "By",
  "765": "idx",
  "766": "gth",
  "767": "ength",
  "768": "length",
  "769": "i = 0",
  "770": "let i = 0",
  "771": "tat",
  "772": "Stat",
  "773": "from",
  "774": " ID",
  "775": "- The ",
  "776": "quence ",
  "777": "s the ",
  "778": "ck",
  "779": "heck",
  "780": "-s",
  "781": "id=\"",
  "782": "border-",
  "783": "color: #",
  "784": "\"></",
  "785": "Index",
  "786": "pixelIndex",
  "787": "min",
  "788": "values",
  "789": "matrixSize",
  "790": "Tim",
  "791": "random",
  "792": "AttribLoc",
  "793": "AT",
  "794": "(shader",
  "795": "(this.gl.",
  "796": "vertex",
  "797": "matrix ",
  "798": "Multipl",
  "799": "\n   * @param {LogicalMatrix!} ",
  "800": "texture ",
  "801": " = gl.",
  "802": "for the ",
  "803": "osition",
  "804": "this.quad",
  "805": "Context",
  "806": "\\n",
  "807": "ml",
  "808": "html",
  "809": "',\n      '",
  "810": "Ma",
  "811": "wait ",
  "812": "y-",
  "813": "vocabJson",
  "814": "',\n    ",
  "815": "adding",
  "816": "padding",
  "817": "ign",
  "818": "read",
  "819": "Content",
  "820": ");\n\n  const ",
  "821": "ong",
  "822": "strong",
  "823": "outputDiv.appendChild(",
  "824": "HTML = ",
  "825": ".innerHTML = ",
  "826": "Id('",
  "827": "ById('",
  "828": "ElementById('",
  "829": "getElementById('",
  "830": "put ",
  "831": "int ",
  "832": "(a",
  "833": "Str",
  "834": "ity",
  "835": "c ",
  "836": "string} ",
  "837": "); // ",
  "838": "uct",
  "839": "clas",
  "840": "tokenizer.",
  "841": "pair[",
  "842": "== ",
  "843": "th.",
  "844": "t(",
  "845": "let i = 0; i",
  "846": "for (let i = 0; i",
  "847": "unction ",
  "848": "function ",
  "849": "pair ",
  "850": "token ID",
  "851": "[]",
  "852": "\n * @param {",
  "853": "quence of ",
  "854": ">\n    <",
  "855": "#output-container",
  "856": " id=\"",
  "857": "ont",
  "858": "background-",
  "859": "di",
  "860": "0.5",
  "861": "pixelIndex + ",
  "862": "data[pixelIndex + ",
  "863": ".data[pixelIndex + ",
  "864": "imageData.data[pixelIndex + ",
  "865": "us: ",
  "866": "</p>",
  "867": "Math.",
  "868": "cen",
  "869": "A_width",
  "870": "(gl.FRAME",
  "871": "\n    gl.",
  "872": "tom",
  "873": "ttom",
  "874": "ft",
  "875": "left",
  "876": "ST",
  "877": "ach",
  "878": ";\n    const ",
  "879": "vec2 ",
  "880": ";\n        ",
  "881": "gpu.",
  "882": ".');\n    }\n    ",
  "883": "at ",
  "884": "tens",
  "885": "Un",
  "886": "TexCoord",
  "887": "mm_",
  "888": "is ",
  "889": "Re",
  "890": "allJs",
  "891": "script",
  "892": " not ",
  "893": "null",
  "894": "SON",
  "895": "JSON",
  "896": "able",
  "897": "sty",
  "898": "Vocab",
  "899": "`<",
  "900": ");\n\n  // ",
  "901": "re ",
  "902": "pre",
  "903": "display",
  "904": ", b",
  "905": "break",
  "906": "this.vocab.",
  "907": "type {",
  "908": "@type {",
  "909": " @type {",
  "910": "/** @type {",
  "911": "or(",
  "912": "truct",
  "913": "construct",
  "914": "class ",
  "915": "Pair",
  "916": "0]",
  "917": "+ ",
  "918": ") + ",
  "919": "i]",
  "920": "; i++",
  "921": "for (let i = 0; i < ",
  "922": ") {\n  const ",
  "923": "[]} ",
  "924": "number[]} ",
  "925": "check",
  "926": "#output-container ",
  "927": "6px;\n      ",
  "928": "margin-",
  "929": ": 2",
  "930": "font",
  "931": "background-color: #",
  "932": ">\n\n",
  "933": "center",
  "934": "texCoordB",
  "935": "/ float(",
  "936": "texCoordA",
  "937": "d_",
  "938": "element",
  "939": "am",
  "940": "max",
  "941": ", matrixSize",
  "942": "0 ",
  "943": ".height",
  "944": "0, 0, ",
  "945": "context.",
  "946": "height ",
  "947": "width, ",
  "948": "LO",
  "949": "_BUFFER, ",
  "950": "Y_BUFFER, ",
  "951": "RAY_BUFFER, ",
  "952": "RRAY_BUFFER, ",
  "953": "ARRAY_BUFFER, ",
  "954": "(this.gl.ARRAY_BUFFER, ",
  "955": "0.0, // ",
  "956": "rame",
  "957": "Parame",
  "958": "tach",
  "959": "attach",
  "960": " = this.gl.",
  "961": "ource",
  "962": "\n   */\n  _create",
  "963": " = this._create",
  "964": "    ",
  "965": ", c",
  "966": "ute",
  "967": "aile",
  "968": ");\n    if (!",
  "969": "float ",
  "970": " +\n        ",
  "971": "row",
  "972": "WebGL ",
  "973": "this.mm_",
  "974": ";\n    this.",
  "975": ") {\n    this.",
  "976": "\n   * @param {WebGL",
  "977": "\n  /**\n   * ",
  "978": " w",
  "979": "et",
  "980": ".js',\n      '",
  "981": "d to ",
  "982": "await ",
  "983": "ment ",
  "984": "yn",
  "985": "asyn",
  "986": "-button",
  "987": "Button",
  "988": " and ",
  "989": "or ",
  "990": "abl",
  "991": "f9",
  "992": "style",
  "993": "vo",
  "994": ";\n  outputDiv.appendChild(",
  "995": "textContent = ",
  "996": "title",
  "997": "--",
  "998": "ou",
  "999": " = document.getElementById('",
  "1000": "orig",
  "1001": "Res",
  "1002": "s to ",
  "1003": "coded ",
  "1004": " |",
  "1005": "(a, b",
  "1006": "()",
  "1007": "..",
  "1008": "topPair",
  "1009": "stat",
  "1010": ");\n\n    // ",
  "1011": "red ",
  "1012": "tra",
  "1013": " */\n    ",
  "1014": "} */\n    ",
  "1015": "wh",
  "1016": "e the ",
  "1017": "plac",
  "1018": "| ",
  "1019": " */\n",
  "1020": "\n */\n",
  "1021": " a ",
  "1022": "map",
  "1023": "Map",
  "1024": "quence of token ID",
  "1025": "a s",
  "1026": "/**\n * ",
  "1027": "ts",
  "1028": "box",
  "1029": ";\n      padding",
  "1030": "dius: ",
  "1031": "radius: ",
  "1032": "border-radius: ",
  "1033": "0px;\n      ",
  "1034": ": 100",
  "1035": "align",
  "1036": ": center",
  "1037": "c=\"",
  "1038": "rc=\"",
  "1039": "src=\"",
  "1040": "t src=\"",
  "1041": "script src=\"",
  "1042": "\n      imageData.data[pixelIndex + ",
  "1043": "nel",
  "1044": "annel",
  "1045": "channel",
  "1046": "value ",
  "1047": "minValu",
  "1048": "mad",
  "1049": ", gl.",
  "1050": ");\n    gl.tex",
  "1051": "this.height",
  "1052": "ero",
  "1053": "zero",
  "1054": "a.width",
  "1055": "i(this.",
  "1056": "1i(this.",
  "1057": "uniform1i(this.",
  "1058": "B_width",
  "1059": "A_height",
  "1060": "Width",
  "1061": "(program, '",
  "1062": "ation(program, '",
  "1063": "Location(program, '",
  "1064": "iformLocation(program, '",
  "1065": "UniformLocation(program, '",
  "1066": "getUniformLocation(program, '",
  "1067": " = gl.getUniformLocation(program, '",
  "1068": "Loc = gl.getUniformLocation(program, '",
  "1069": " for ",
  "1070": "(gl.FRAMEBUFFER, ",
  "1071": "1.0, 0.0, // ",
  "1072": " = new Float32Array",
  "1073": "MP",
  "1074": "CO",
  "1075": ", s",
  "1076": "sS",
  "1077": "unit ",
  "1078": "le.",
  "1079": "Info",
  "1080": "log",
  "1081": "essa",
  "1082": "messa",
  "1083": "fragment",
  "1084": "****************",
  "1085": "Matrix ",
  "1086": "Multiply",
  "1087": "MatrixMultiply",
  "1088": "Texture(",
  "1089": "delete",
  "1090": "ailed to ",
  "1091": "buffer",
  "1092": "por",
  "1093": "up",
  "1094": ");\n\n    ",
  "1095": ";\n  }\n\n  /**",
  "1096": "Position",
  "1097": " null",
  "1098": "Gpu",
  "1099": "\n   */\n  construct",
  "1100": "conten",
  "1101": "ard",
  "1102": "cop",
  "1103": "ase ",
  "1104": "text-",
  "1105": "ed",
  "1106": "json",
  "1107": "y-json",
  "1108": "of the ",
  "1109": "nd",
  "1110": "ert",
  "1111": "Top",
  "1112": "ite",
  "1113": "id #",
  "1114": "olid #",
  "1115": " solid #",
  "1116": "px solid #",
  "1117": ".length",
  "1118": "strong>",
  "1119": "ure ",
  "1120": "vi",
  "1121": "original",
  "1122": "Result",
  "1123": "result",
  "1124": "Display",
  "1125": "oin",
  "1126": "text = ",
  "1127": "De",
  "1128": "arne",
  "1129": ");\n      const ",
  "1130": ") =",
  "1131": "\n      const ",
  "1132": "d the ",
  "1133": "\n      // ",
  "1134": ". ",
  "1135": "256",
  "1136": "vocabulary ",
  "1137": "size",
  "1138": "vocab_",
  "1139": "\n   * @param {string} ",
  "1140": "Tokenizer",
  "1141": "PE",
  "1142": "=== ",
  "1143": "new",
  "1144": ", idx",
  "1145": "(ids",
  "1146": "number} ",
  "1147": "cur",
  "1148": "[i]",
  "1149": "\n */\nfunction ",
  "1150": " from",
  "1151": "requen",
  "1152": "frequen",
  "1153": ";\n    }\n\n    #output-container ",
  "1154": "4px;\n      ",
  "1155": "f2",
  "1156": "64",
  "1157": "\" ",
  "1158": ">\n</",
  "1159": ": 10px;\n      ",
  "1160": ": 1px solid #",
  "1161": "border: 1px solid #",
  "1162": ": center;\n      ",
  "1163": "\"></script",
  "1164": ".js\"></script",
  "1165": "head",
  "1166": "vec2(",
  "1167": " = vec2(",
  "1168": "texCoord.",
  "1169": "inate",
  "1170": "ordinate",
  "1171": "coordinate",
  "1172": "Bl",
  "1173": " = 0; // ",
  "1174": "tensity",
  "1175": "intensity",
  "1176": "maxValu",
  "1177": "`<p>",
  "1178": "ication",
  "1179": "` +\n        ",
  "1180": "0;\n      ",
  "1181": ") - ",
  "1182": "Math.random",
  "1183": "gl.TEXTURE_",
  "1184": "(gl.TEXTURE_2D, gl.TEXTURE_",
  "1185": "ri(gl.TEXTURE_2D, gl.TEXTURE_",
  "1186": "teri(gl.TEXTURE_2D, gl.TEXTURE_",
  "1187": "Parameteri(gl.TEXTURE_2D, gl.TEXTURE_",
  "1188": ");\n    gl.texParameteri(gl.TEXTURE_2D, gl.TEXTURE_",
  "1189": ");\n        ",
  "1190": ":\n        ",
  "1191": "Texture(gl.TEXTURE_2D, ",
  "1192": "bindTexture(gl.TEXTURE_2D, ",
  "1193": ");\n    gl.bindTexture(gl.TEXTURE_2D, ",
  "1194": "ive",
  "1195": ");\n    gl.uniform1i(this.",
  "1196": "Loc, ",
  "1197": "');\n    this.",
  "1198": "width * ",
  "1199": "Status",
  "1200": "\n    if (",
  "1201": "complete",
  "1202": "BO",
  "1203": "FBO",
  "1204": " = this.context.",
  "1205": " texture",
  "1206": "ixels(",
  "1207": "Pixels(",
  "1208": "readPixels(",
  "1209": ", 0, ",
  "1210": "AT, ",
  "1211": "LOAT, ",
  "1212": "FLOAT, ",
  "1213": "ointer",
  "1214": "Se",
  "1215": "Buffer);\n    this.gl.",
  "1216": "(this.gl.ARRAY_BUFFER, this.quad",
  "1217": "Buffer(this.gl.ARRAY_BUFFER, this.quad",
  "1218": "bindBuffer(this.gl.ARRAY_BUFFER, this.quad",
  "1219": "ght",
  "1220": "right",
  "1221": "-right",
  "1222": "ottom",
  "1223": "Bottom",
  "1224": "left\n      ",
  "1225": "-left\n      ",
  "1226": "set",
  "1227": " = this.gl.create",
  "1228": "in(",
  "1229": "main(",
  "1230": " shader",
  "1231": "ole.",
  "1232": "console.",
  "1233": "message",
  "1234": "Program(this.",
  "1235": "uad",
  "1236": "Quad",
  "1237": "(a, b, c",
  "1238": "ecute",
  "1239": "execute",
  "1240": "initialize",
  "1241": "framebuffer",
  "1242": "ailed to create",
  "1243": "Failed to create",
  "1244": ") {\n      throw new Error('Failed to create",
  "1245": "initializ",
  "1246": "}\n   */\n  ",
  "1247": " = null",
  "1248": "fin",
  "1249": "async ",
  "1250": " {\n  /**\n   * ",
  "1251": "gl = ",
  "1252": ", fbo",
  "1253": "gl, fbo",
  "1254": "\n   */\n  constructor(",
  "1255": "erform",
  "1256": "\\n'",
  "1257": "\\r",
  "1258": "// Re",
  "1259": "content",
  "1260": "pon",
  "1261": "respon",
  "1262": "multipl",
  "1263": "pbo",
  "1264": "ipbo",
  "1265": "?.",
  "1266": "');\n  const ",
  "1267": "> {",
  "1268": ") => {",
  "1269": "', ",
  "1270": "er('",
  "1271": "tener('",
  "1272": "istener('",
  "1273": "Listener('",
  "1274": "entListener('",
  "1275": "ventListener('",
  "1276": "EventListener('",
  "1277": "addEventListener('",
  "1278": "JSON ",
  "1279": "), ",
  "1280": "cess",
  "1281": ");\n}\n\n",
  "1282": "and",
  "1283": "ow",
  "1284": "tbody",
  "1285": "th>",
  "1286": "table",
  "1287": "able ",
  "1288": "-w",
  "1289": "f9f9",
  "1290": "e2",
  "1291": "ddd",
  "1292": "ass",
  "1293": "bject",
  "1294": "Content ",
  "1295": "ContentDiv",
  "1296": "decodedContentDiv",
  "1297": "Vocabular",
  "1298": ":</",
  "1299": "P.innerHTML = ",
  "1300": "p');\n  ",
  "1301": " = document.createElement('p');\n  ",
  "1302": "P = document.createElement('p');\n  ",
  "1303": "al ",
  "1304": ".textContent = ",
  "1305": "er ",
  "1306": "encodedId",
  "1307": "arned ",
  "1308": "s a ",
  "1309": ");\n    }\n  ",
  "1310": "(pair[",
  "1311": "in the ",
  "1312": "break;\n      ",
  "1313": ") {\n        ",
  "1314": "ly ",
  "1315": "255",
  "1316": "));\n\n    // ",
  "1317": "c.",
  "1318": ".from",
  "1319": "ids = ",
  "1320": ") {\n    // ",
  "1321": "(text, ",
  "1322": " size",
  "1323": "final",
  "1324": "siz",
  "1325": ";\n    }\n  ",
  "1326": " += ",
  "1327": " === ",
  "1328": "s = ",
  "1329": "newId",
  "1330": "merg",
  "1331": "ter ",
  "1332": "af",
  "1333": ".\n * @param {",
  "1334": "all ",
  "1335": "Mer",
  "1336": "set(",
  "1337": "}`",
  "1338": "s.length",
  "1339": "coun",
  "1340": "sequence of token ID",
  "1341": "ids ",
  "1342": "a se",
  "1343": "-check",
  "1344": "ts-check",
  "1345": "@ts-check",
  "1346": "// @ts-check",
  "1347": "button>\n    <",
  "1348": "</button>\n    <",
  "1349": "-button\">",
  "1350": "button id=\"",
  "1351": "margin-top",
  "1352": " {\n      background-color: #",
  "1353": ": 16px;\n      ",
  "1354": "border-radius: 6px;\n      ",
  "1355": ";\n      border-radius: 6px;\n      ",
  "1356": "border: 1px solid #ddd",
  "1357": "area",
  "1358": "textarea",
  "1359": "bottom",
  "1360": "margin-bottom",
  "1361": "-size",
  "1362": "font-size",
  "1363": "h1",
  "1364": "text-align",
  "1365": "px ",
  "1366": "8px;\n      ",
  "1367": ": 24px;\n      ",
  "1368": "00px;\n      ",
  "1369": "%;\n      ",
  "1370": ": 100%;\n      ",
  "1371": "width: 100%;\n      ",
  "1372": "box-s",
  "1373": "izing",
  "1374": "div id=\"",
  "1375": "y: ",
  "1376": "-height",
  "1377": "over",
  "1378": ": 0;\n      ",
  "1379": ">\n  <script src=\"",
  "1380": ">\n\n  <",
  "1381": ">\n\n<",
  "1382": "d_texCoordB",
  "1383": "\n    vec2 ",
  "1384": "d_texCoordA",
  "1385": "sum",
  "1386": "rowC",
  "1387": "colC",
  "1388": "0.5 ",
  "1389": " (the ",
  "1390": "utput ",
  "1391": "Output ",
  "1392": "B_height",
  "1393": " int ",
  "1394": "uniform int ",
  "1395": "ampl",
  "1396": "texture coordinate",
  "1397": "p ",
  "1398": "Blu",
  "1399": "channel for ",
  "1400": "as ",
  "1401": "ctx",
  "1402": "values.length",
  "1403": "ms",
  "1404": "Multiplication",
  "1405": "Matrix Multiplication",
  "1406": "WebGL Matrix Multiplication",
  "1407": "` +\n        `<p>",
  "1408": "Time",
  "1409": "putation",
  "1410": "computation",
  "1411": " c",
  "1412": "mads",
  "1413": ", matrixSize, '",
  "1414": ", matrixSize, matrixSize, '",
  "1415": "context, matrixSize, matrixSize, '",
  "1416": "gpu.context, matrixSize, matrixSize, '",
  "1417": "(gpu.context, matrixSize, matrixSize, '",
  "1418": "LogicalMatrix(gpu.context, matrixSize, matrixSize, '",
  "1419": " = new LogicalMatrix(gpu.context, matrixSize, matrixSize, '",
  "1420": "Time = ",
  "1421": "art",
  "1422": "start",
  "1423": "}\n\n  ",
  "1424": "sion",
  "1425": "1.0 ",
  "1426": "Math.random(",
  "1427": "_T",
  "1428": " = texture",
  "1429": "width * this.height",
  "1430": "(this.width * this.height",
  "1431": " = new Float32Array(this.width * this.height",
  "1432": "Ident",
  "1433": ");\n        break;\n      ",
  "1434": "andom",
  "1435": "Random",
  "1436": " = this._createFloat",
  "1437": "texture = this._createFloat",
  "1438": "':\n        ",
  "1439": "ase '",
  "1440": "case '",
  "1441": "height = ",
  "1442": "wpor",
  "1443": "ewpor",
  "1444": "viewpor",
  "1445": ".height ",
  "1446": "ight",
  "1447": "eight",
  "1448": "matrixB",
  "1449": "matrixA",
  "1450": ", 0",
  "1451": "0, gl.",
  "1452": "Framebuffer(gl.FRAMEBUFFER, ",
  "1453": "bindFramebuffer(gl.FRAMEBUFFER, ",
  "1454": "\n    gl.bindFramebuffer(gl.FRAMEBUFFER, ",
  "1455": ".\n    gl.bindFramebuffer(gl.FRAMEBUFFER, ",
  "1456": "gl;\n    const ",
  "1457": "\n   * @returns {Float32Array",
  "1458": "PU",
  "1459": "texAttribLoc",
  "1460": ", 0, 0",
  "1461": ", this.gl.FLOAT, ",
  "1462": "osAttribLoc",
  "1463": "posAttribLoc",
  "1464": "(shaderProgram",
  "1465": "1.0, 0.0, // Bottom",
  "1466": "position",
  "1467": "s for the ",
  "1468": " comp",
  "1469": "LE",
  "1470": "COMP",
  "1471": "type",
  "1472": "_ST",
  "1473": "ink",
  "1474": "();\n    this.gl.",
  "1475": "NT",
  "1476": "MENT",
  "1477": "fragmentShader",
  "1478": "AD",
  "1479": "_S",
  "1480": "vertexShader",
  "1481": "1.0",
  "1482": "vec4",
  "1483": "void ",
  "1484": "out ",
  "1485": "aTexCoord",
  "1486": "Pos",
  "1487": "300",
  "1488": "ertex",
  "1489": "Vertex",
  "1490": "sSource",
  "1491": "unit quad",
  "1492": "stand",
  "1493": "info",
  "1494": "Info(",
  "1495": "logInfo(",
  "1496": "\n   */\n  _",
  "1497": "context, ",
  "1498": "RI",
  "1499": "      ",
  "1500": "this.mm_program",
  "1501": "\n   * @param {LogicalMatrix!} b",
  "1502": "a \n   * @param {LogicalMatrix!} b",
  "1503": "\n   * @param {LogicalMatrix!} a \n   * @param {LogicalMatrix!} b",
  "1504": ");\n  }\n\n  /**",
  "1505": "this.gl.delete",
  "1506": ");\n    return ",
  "1507": "es ",
  "1508": " b",
  "1509": "canvas.",
  "1510": "() {\n    const ",
  "1511": " | null",
  "1512": "fined",
  "1513": "defined",
  "1514": "undefined",
  "1515": "context = ",
  "1516": ";\n    /** @type {",
  "1517": "ste",
  "1518": "od ",
  "1519": "cul",
  "1520": "alcul",
  "1521": "perform",
  "1522": "This ",
  "1523": "place",
  "1524": "allJsContent",
  "1525": "ith",
  "1526": " with",
  "1527": "allJsContent = ",
  "1528": "roject",
  "1529": "Project",
  "1530": "not ",
  "1531": "ard ",
  "1532": "ipboard",
  "1533": "clipboard",
  "1534": "av",
  "1535": "lement ",
  "1536": "ment = ",
  "1537": "value",
  "1538": ") => {\n    const ",
  "1539": "k', ",
  "1540": "ick', ",
  "1541": "click', ",
  "1542": "addEventListener('click', ",
  "1543": "?.addEventListener('click', ",
  "1544": "Button?.addEventListener('click', ",
  "1545": "Button = document.getElementById('",
  "1546": "DO",
  "1547": "});\n",
  "1548": "vocabulary-json",
  "1549": "(vocabJson",
  "1550": ");\n  const ",
  "1551": "mo",
  "1552": "Tokenization",
  "1553": "DisplayTokenization",
  "1554": "ndDisplayTokenization",
  "1555": "AndDisplayTokenization",
  "1556": "cessAndDisplayTokenization",
  "1557": "processAndDisplayTokenization",
  "1558": "();\n      ",
  "1559": "sert",
  "1560": ".insert",
  "1561": "><",
  "1562": "vocabT",
  "1563": "pace",
  "1564": "white",
  "1565": "lor",
  "1566": "Color",
  "1567": "fe2",
  "1568": "0px",
  "1569": "assign",
  "1570": "Object",
  "1571": "bl",
  "1572": "ing to ",
  "1573": "textContent ",
  "1574": "P);\n\n  // ",
  "1575": "}`;\n  outputDiv.appendChild(",
  "1576": "> ${",
  "1577": "strong> ${",
  "1578": ":</strong> ${",
  "1579": "`<strong>",
  "1580": "P.innerHTML = `<strong>",
  "1581": "';\n  outputDiv.appendChild(",
  "1582": "document.createElement('",
  "1583": "e = document.createElement('",
  "1584": "sure ",
  "1585": "mat",
  "1586": "UI",
  "1587": "''",
  "1588": ") return",
  "1589": "tokenizer, ",
  "1590": "on the ",
  "1591": ";\n  }\n",
  "1592": "decode",
  "1593": ";\n  }\n\n  /**\n   * ",
  "1594": "for (const ",
  "1595": "the",
  "1596": "learned ",
  "1597": "encode",
  "1598": "string.",
  "1599": "input ",
  "1600": "string ",
  "1601": "this.vocab.get",
  "1602": "| !",
  "1603": "e and ",
  "1604": "Sto",
  "1605": "map(",
  "1606": "topPairStr",
  "1607": "o ",
  "1608": "[1]",
  "1609": ".re",
  "1610": "es()",
  "1611": "ries()",
  "1612": "entries()",
  "1613": "...",
  "1614": "try",
  "1615": "Entry",
  "1616": "topPairEntry",
  "1617": "ind the ",
  "1618": ") {\n      const ",
  "1619": "s\n    const ",
  "1620": "frequent ",
  "1621": "t frequent ",
  "1622": "ost frequent ",
  "1623": "most frequent ",
  "1624": "}\n\n    // ",
  "1625": "String",
  "1626": "(0",
  "1627": "Code",
  "1628": "arCode",
  "1629": "=> ",
  "1630": "train",
  "1631": "ired ",
  "1632": "size ",
  "1633": "\n   * @param {number} ",
  "1634": "text to ",
  "1635": "tokenizer ",
  "1636": "this.merge",
  "1637": "PETokenizer",
  "1638": "BPETokenizer",
  "1639": "impl",
  "1640": "e {\n      ",
  "1641": "els",
  "1642": "} els",
  "1643": "&&",
  "1644": ") {\n    if (",
  "1645": "(i",
  "1646": "pair, idx",
  "1647": ", pair, idx",
  "1648": "(ids, pair, idx",
  "1649": "merge(ids, pair, idx",
  "1650": "ing.",
  "1651": "after ",
  "1652": " to ",
  "1653": "a new ",
  "1654": "into ",
  "1655": "ic ",
  "1656": "ren",
  "1657": "curren",
  "1658": "Merge",
  "1659": "}\n\n/**\n * ",
  "1660": "pair = ",
  "1661": "; i++) {\n    const ",
  "1662": "ids.length",
  "1663": "Map(",
  "1664": " = new Map(",
  "1665": "Map<",
  "1666": "- The sequence of token ID",
  "1667": "ids - The sequence of token ID",
  "1668": "number[]} ids - The sequence of token ID",
  "1669": "s.\n * @param {",
  "1670": "// @ts-check\n\n",
  "1671": "\"></div",
  "1672": "</button>\n    <div id=\"",
  "1673": "-button\">Tokeniz",
  "1674": "button id=\"tokenize",
  "1675": "f2f2",
  "1676": ";\n    }\n\n    #output-container th",
  "1677": "apse",
  "1678": "lapse",
  "1679": "collapse",
  "1680": "\n    #output-container ",
  "1681": ",\n    #output-container ",
  "1682": ": left",
  "1683": "text-align: left",
  "1684": " {\n      margin-top",
  "1685": ": 12",
  "1686": " {\n      background-color: #00",
  "1687": ";\n    }\n\n    button",
  "1688": ";\n      border-radius: 6px;\n      font-size",
  "1689": "border: 1px solid #dddfe2",
  "1690": " {\n      width: 100%;\n      ",
  "1691": "border-box",
  "1692": ": border-box",
  "1693": "izing: border-box",
  "1694": "box-sizing: border-box",
  "1695": "stem",
  "1696": "ystem",
  "1697": "Tokenizer</",
  "1698": ">Tokenizer</",
  "1699": "\">\n  <",
  "1700": "eta ",
  "1701": "meta ",
  "1702": "</html",
  "1703": ">\n\n</html",
  "1704": "body>\n\n</html",
  "1705": ">\n</body>\n\n</html",
  "1706": ".js\"></script>\n</body>\n\n</html",
  "1707": "</div",
  "1708": "\n  </div",
  "1709": "\n    <p>",
  "1710": "=\"64",
  "1711": "body>\n  <",
  "1712": ">\n\n<body>\n  <",
  "1713": "head>\n\n<body>\n  <",
  "1714": ">\n</head>\n\n<body>\n  <",
  "1715": "style>\n</head>\n\n<body>\n  <",
  "1716": "</style>\n</head>\n\n<body>\n  <",
  "1717": ";\n    }\n  </style>\n</head>\n\n<body>\n  <",
  "1718": "padding: 10px;\n      ",
  "1719": "0, 0.",
  "1720": "0, 0, 0, 0.",
  "1721": "(0, 0, 0, 0.",
  "1722": "a(0, 0, 0, 0.",
  "1723": "ba(0, 0, 0, 0.",
  "1724": "gba(0, 0, 0, 0.",
  "1725": "rgba(0, 0, 0, 0.",
  "1726": "55",
  "1727": "ily: ",
  "1728": "amily: ",
  "1729": "family: ",
  "1730": "-family: ",
  "1731": "font-family: ",
  "1732": "ee",
  "1733": ";\n      color: #",
  "1734": "33",
  "1735": ";\n      background-color: #",
  "1736": "vh",
  "1737": ": 100vh",
  "1738": "-height: 100vh",
  "1739": "min-height: 100vh",
  "1740": ": center;\n      min-height: 100vh",
  "1741": "ms: center;\n      min-height: 100vh",
  "1742": "items: center;\n      min-height: 100vh",
  "1743": "-items: center;\n      min-height: 100vh",
  "1744": "align-items: center;\n      min-height: 100vh",
  "1745": ": center;\n      align-items: center;\n      min-height: 100vh",
  "1746": "content: center;\n      align-items: center;\n      min-height: 100vh",
  "1747": "y-content: center;\n      align-items: center;\n      min-height: 100vh",
  "1748": "ify-content: center;\n      align-items: center;\n      min-height: 100vh",
  "1749": "stify-content: center;\n      align-items: center;\n      min-height: 100vh",
  "1750": "ustify-content: center;\n      align-items: center;\n      min-height: 100vh",
  "1751": "justify-content: center;\n      align-items: center;\n      min-height: 100vh",
  "1752": ";\n      justify-content: center;\n      align-items: center;\n      min-height: 100vh",
  "1753": "x;\n      justify-content: center;\n      align-items: center;\n      min-height: 100vh",
  "1754": "lex;\n      justify-content: center;\n      align-items: center;\n      min-height: 100vh",
  "1755": "flex;\n      justify-content: center;\n      align-items: center;\n      min-height: 100vh",
  "1756": ": flex;\n      justify-content: center;\n      align-items: center;\n      min-height: 100vh",
  "1757": "display: flex;\n      justify-content: center;\n      align-items: center;\n      min-height: 100vh",
  "1758": "flow",
  "1759": "overflow",
  "1760": "margin: 0;\n      ",
  "1761": "body {\n      ",
  "1762": "\n    body {\n      ",
  "1763": ">\n    body {\n      ",
  "1764": "style>\n    body {\n      ",
  "1765": ">\n\n  <script src=\"",
  "1766": "head>\n  <",
  "1767": "<html",
  "1768": ">\n<html",
  "1769": "html>\n<html",
  "1770": " html>\n<html",
  "1771": "PE html>\n<html",
  "1772": "YPE html>\n<html",
  "1773": "TYPE html>\n<html",
  "1774": "CTYPE html>\n<html",
  "1775": "DOCTYPE html>\n<html",
  "1776": "!DOCTYPE html>\n<html",
  "1777": "sca",
  "1778": "Store ",
  "1779": "elementB",
  "1780": "r;\n        ",
  "1781": ").r;\n        ",
  "1782": " = texture(",
  "1783": "elementA",
  "1784": ") / float(",
  "1785": "0.5) / float(",
  "1786": ") + 0.5) / float(",
  "1787": "(float(",
  "1788": "0.5 / float(",
  "1789": "B_height));\n\n    // ",
  "1790": "A_width), ",
  "1791": "1.0 / float(",
  "1792": ").\n    vec2 ",
  "1793": "for matrix ",
  "1794": "ction for matrix ",
  "1795": "rection for matrix ",
  "1796": "direction for matrix ",
  "1797": "k (the ",
  "1798": "in k (the ",
  "1799": "p in k (the ",
  "1800": "tep in k (the ",
  "1801": " step in k (the ",
  "1802": "1 step in k (the ",
  "1803": "ing 1 step in k (the ",
  "1804": "ving 1 step in k (the ",
  "1805": "moving 1 step in k (the ",
  "1806": "s to moving 1 step in k (the ",
  "1807": "ds to moving 1 step in k (the ",
  "1808": "responds to moving 1 step in k (the ",
  "1809": "orresponds to moving 1 step in k (the ",
  "1810": " corresponds to moving 1 step in k (the ",
  "1811": "cre",
  "1812": "ate the ",
  "1813": "alculate the ",
  "1814": "0.0",
  "1815": ") - 0.5",
  "1816": " * float(",
  "1817": "t(texCoord.",
  "1818": "int(texCoord.",
  "1819": " = int(texCoord.",
  "1820": "\n    int ",
  "1821": "texel",
  "1822": "her",
  "1823": "ct ",
  "1824": "maps to ",
  "1825": "x ",
  "1826": "matrix C",
  "1827": " of the ",
  "1828": "umn",
  "1829": "column",
  "1830": "current ",
  "1831": "ted ",
  "1832": "puted ",
  "1833": "computed ",
  "1834": "fragColor",
  "1835": ";\nuniform int ",
  "1836": "ing matrix ",
  "1837": "containing matrix ",
  "1838": " containing matrix ",
  "1839": "Texture containing matrix ",
  "1840": "; // Texture containing matrix ",
  "1841": "2D ",
  "1842": "er2D ",
  "1843": "ampler2D ",
  "1844": " sampler2D ",
  "1845": "uniform sampler2D ",
  "1846": "ision ",
  "1847": "prec",
  "1848": "] = ",
  "1849": "gat",
  "1850": "negat",
  "1851": "e\n    ",
  "1852": "Blue\n    ",
  "1853": "\n      imageData.data[pixelIndex + 2",
  "1854": "en\n      imageData.data[pixelIndex + 2",
  "1855": "reen\n      imageData.data[pixelIndex + 2",
  "1856": "Green\n      imageData.data[pixelIndex + 2",
  "1857": " = 0; // Green\n      imageData.data[pixelIndex + 2",
  "1858": "1] = 0; // Green\n      imageData.data[pixelIndex + 2",
  "1859": "\n      imageData.data[pixelIndex + 1] = 0; // Green\n      imageData.data[pixelIndex + 2",
  "1860": "d\n      imageData.data[pixelIndex + 1] = 0; // Green\n      imageData.data[pixelIndex + 2",
  "1861": "Red\n      imageData.data[pixelIndex + 1] = 0; // Green\n      imageData.data[pixelIndex + 2",
  "1862": "255); // ",
  "1863": " * 255); // ",
  "1864": "intensity * 255); // ",
  "1865": "or(intensity * 255); // ",
  "1866": "floor(intensity * 255); // ",
  "1867": "Math.floor(intensity * 255); // ",
  "1868": "e;\n      ",
  "1869": "value / ",
  "1870": " = value / ",
  "1871": "intensity = value / ",
  "1872": "\n      const intensity = value / ",
  "1873": "values\n      const intensity = value / ",
  "1874": "e values\n      const intensity = value / ",
  "1875": "ive values\n      const intensity = value / ",
  "1876": "posit",
  "1877": ", A",
  "1878": "has ",
  "1879": " has ",
  "1880": "\n  }\n\n  ",
  "1881": "minValue",
  "1882": "e = value",
  "1883": "value > ",
  "1884": ";\n    if (",
  "1885": "values[i]",
  "1886": "e = values[i]",
  "1887": "value = values[i]",
  "1888": "; i++) {\n    const value = values[i]",
  "1889": "values.length; i++) {\n    const value = values[i]",
  "1890": "for (let i = 0; i < values.length; i++) {\n    const value = values[i]",
  "1891": "e = 0",
  "1892": "mageData(",
  "1893": "ImageData(",
  "1894": "ctx.",
  "1895": "anvas(",
  "1896": "Canvas(",
  "1897": "ToCanvas(",
  "1898": "32ToCanvas(",
  "1899": "float32ToCanvas(",
  "1900": "Values",
  "1901": "resultValues",
  "1902": ")} ",
  "1903": "ed(",
  "1904": "ixed(",
  "1905": "Fixed(",
  "1906": "toFixed(",
  "1907": "Status: ",
  "1908": ")</p>",
  "1909": "matrixSize}",
  "1910": "${matrixSize}",
  "1911": "WebGL Matrix Multiplication (",
  "1912": ": ${",
  "1913": "teration",
  "1914": "/ 1",
  "1915": "Secon",
  "1916": "erSecon",
  "1917": "PerSecon",
  "1918": "madsPerSecon",
  "1919": "Time ",
  "1920": "readPixels(c",
  "1921": "gpu.readPixels(c",
  "1922": "PU to ",
  "1923": "ill",
  "1924": " will",
  "1925": ") {\n      // Re",
  "1926": "0) {\n      // Re",
  "1927": "mads ",
  "1928": "; ++",
  "1929": ";\n  let ",
  "1930": "ONS",
  "1931": "IONS",
  "1932": "TIONS",
  "1933": "RATIONS",
  "1934": "TERATIONS",
  "1935": "ITERATIONS",
  "1936": "_ITERATIONS",
  "1937": "M_ITERATIONS",
  "1938": "UM_ITERATIONS",
  "1939": "NUM_ITERATIONS",
  "1940": "random');\n  const ",
  "1941": " = new LogicalMatrix(gpu.context, matrixSize, matrixSize, 'random');\n  const ",
  "1942": "();\n\n  const ",
  "1943": "now",
  "1944": ".now",
  "1945": "ce.now",
  "1946": "ance.now",
  "1947": "performance.now",
  "1948": "Time = performance.now",
  "1949": "`);\n    }\n  ",
  "1950": "}) ",
  "1951": "sions ",
  "1952": "ensions ",
  "1953": "imensions ",
  "1954": "dimensions ",
  "1955": "b.height",
  "1956": ";\n\n    if (",
  "1957": "this.width",
  "1958": "; j",
  "1959": "return data",
  "1960": "}\n    return data",
  "1961": " = new Float32Array(this.width * this.height);\n    ",
  "1962": "data = new Float32Array(this.width * this.height);\n    ",
  "1963": "() {\n    const data = new Float32Array(this.width * this.height);\n    ",
  "1964": "Data() {\n    const data = new Float32Array(this.width * this.height);\n    ",
  "1965": "data\n   */\n  _create",
  "1966": "\n   * @returns {Float32Array!} ",
  "1967": "Math.random() - ",
  "1968": "n(",
  "1969": "rn(",
  "1970": "GE",
  "1971": "DGE",
  "1972": "EDGE",
  "1973": "_EDGE",
  "1974": "O_EDGE",
  "1975": "_TO_EDGE",
  "1976": "MP_TO_EDGE",
  "1977": "AMP_TO_EDGE",
  "1978": "LAMP_TO_EDGE",
  "1979": "CLAMP_TO_EDGE",
  "1980": ", gl.CLAMP_TO_EDGE",
  "1981": "RAP",
  "1982": "WRAP",
  "1983": ");\n    gl.texParameteri(gl.TEXTURE_2D, gl.TEXTURE_WRAP",
  "1984": "REST",
  "1985": "AREST",
  "1986": "EAREST",
  "1987": "NEAREST",
  "1988": ", gl.NEAREST",
  "1989": "R, gl.NEAREST",
  "1990": "TER, gl.NEAREST",
  "1991": "LTER, gl.NEAREST",
  "1992": "ILTER, gl.NEAREST",
  "1993": "FILTER, gl.NEAREST",
  "1994": "_FILTER, gl.NEAREST",
  "1995": ");\n    gl.texParameteri(gl.TEXTURE_2D, gl.TEXTURE_M",
  "1996": "32F",
  "1997": "R32F",
  "1998": "zeroData",
  "1999": "Identity",
  "2000": ");\n        break;\n      case '",
  "2001": "());\n        break;\n      case '",
  "2002": "Data());\n        break;\n      case '",
  "2003": "(this._create",
  "2004": "Texture(this._create",
  "2005": "texture = this._createFloatTexture(this._create",
  "2006": "':\n        texture = this._createFloatTexture(this._create",
  "2007": " = width",
  "2008": "initialization",
  "2009": "\n\n    gl.",
  "2010": "texture unit ",
  "2011": "); // texture unit ",
  "2012": ");\n    gl.uniform1i(this.matrix",
  "2013": "texture);\n    gl.uniform1i(this.matrix",
  "2014": ".texture);\n    gl.uniform1i(this.matrix",
  "2015": "(gl.TEXTURE",
  "2016": "Texture(gl.TEXTURE",
  "2017": "iveTexture(gl.TEXTURE",
  "2018": "ctiveTexture(gl.TEXTURE",
  "2019": "activeTexture(gl.TEXTURE",
  "2020": "fboStatus",
  "2021": "attaching ",
  "2022": "after attaching ",
  "2023": "us ",
  "2024": "ice ",
  "2025": "ctice ",
  "2026": "ractice ",
  "2027": "practice ",
  "2028": "od practice ",
  "2029": "ood practice ",
  "2030": "\n\n    // ",
  "2031": "qual ",
  "2032": "equal ",
  "2033": "b.height ",
  "2034": "te: ",
  "2035": "ote: ",
  "2036": "Note: ",
  "2037": "// Note: ",
  "2038": " = this.context.gl;\n    const ",
  "2039": "gl = this.context.gl;\n    const ",
  "2040": ") {\n    const gl = this.context.gl;\n    const ",
  "2041": "\n   * @param {LogicalMatrix!} a \n   * @param {LogicalMatrix!} b ",
  "2042": "Program(this.program",
  "2043": "this.program",
  "2044": "dest",
  "2045": "ated ",
  "2046": "roy",
  "2047": "bWidth",
  "2048": "Height",
  "2049": "aHeight",
  "2050": "aWidth",
  "2051": "context = context",
  "2052": ";\n    this.context = context",
  "2053": "\n   */\n  constructor(context, ",
  "2054": "context ",
  "2055": "!} context ",
  "2056": "Context!} context ",
  "2057": "\n   * @param {Context!} context ",
  "2058": " {\n  /**\n   * \n   * @param {Context!} context ",
  "2059": "finalResult",
  "2060": "RED",
  "2061": "width, height",
  "2062": " not complete",
  "2063": "Framebuffer not complete",
  "2064": ") {\n      throw new Error('Framebuffer not complete",
  "2065": "TE) {\n      throw new Error('Framebuffer not complete",
  "2066": "LETE) {\n      throw new Error('Framebuffer not complete",
  "2067": "COMPLETE) {\n      throw new Error('Framebuffer not complete",
  "2068": "_COMPLETE) {\n      throw new Error('Framebuffer not complete",
  "2069": "BUFFER_COMPLETE) {\n      throw new Error('Framebuffer not complete",
  "2070": "FRAMEBUFFER_COMPLETE) {\n      throw new Error('Framebuffer not complete",
  "2071": "gl.FRAMEBUFFER_COMPLETE) {\n      throw new Error('Framebuffer not complete",
  "2072": "== gl.FRAMEBUFFER_COMPLETE) {\n      throw new Error('Framebuffer not complete",
  "2073": "!== gl.FRAMEBUFFER_COMPLETE) {\n      throw new Error('Framebuffer not complete",
  "2074": "(gl.FRAMEBUFFER",
  "2075": "Status(gl.FRAMEBUFFER",
  "2076": "FramebufferStatus(gl.FRAMEBUFFER",
  "2077": "checkFramebufferStatus(gl.FRAMEBUFFER",
  "2078": "FBO ",
  "2079": "texture, 0",
  "2080": "0, gl.TEXTURE_2D, ",
  "2081": "MENT0, gl.TEXTURE_2D, ",
  "2082": "HMENT0, gl.TEXTURE_2D, ",
  "2083": "CHMENT0, gl.TEXTURE_2D, ",
  "2084": "ACHMENT0, gl.TEXTURE_2D, ",
  "2085": "TACHMENT0, gl.TEXTURE_2D, ",
  "2086": "ATTACHMENT0, gl.TEXTURE_2D, ",
  "2087": "_ATTACHMENT0, gl.TEXTURE_2D, ",
  "2088": "R_ATTACHMENT0, gl.TEXTURE_2D, ",
  "2089": "LOR_ATTACHMENT0, gl.TEXTURE_2D, ",
  "2090": "COLOR_ATTACHMENT0, gl.TEXTURE_2D, ",
  "2091": "gl.COLOR_ATTACHMENT0, gl.TEXTURE_2D, ",
  "2092": "(gl.FRAMEBUFFER, gl.COLOR_ATTACHMENT0, gl.TEXTURE_2D, ",
  "2093": "2D(gl.FRAMEBUFFER, gl.COLOR_ATTACHMENT0, gl.TEXTURE_2D, ",
  "2094": "Texture2D(gl.FRAMEBUFFER, gl.COLOR_ATTACHMENT0, gl.TEXTURE_2D, ",
  "2095": "framebufferTexture2D(gl.FRAMEBUFFER, gl.COLOR_ATTACHMENT0, gl.TEXTURE_2D, ",
  "2096": ");\n    gl.framebufferTexture2D(gl.FRAMEBUFFER, gl.COLOR_ATTACHMENT0, gl.TEXTURE_2D, ",
  "2097": "fbo);\n    gl.framebufferTexture2D(gl.FRAMEBUFFER, gl.COLOR_ATTACHMENT0, gl.TEXTURE_2D, ",
  "2098": ".\n    gl.bindFramebuffer(gl.FRAMEBUFFER, fbo);\n    gl.framebufferTexture2D(gl.FRAMEBUFFER, gl.COLOR_ATTACHMENT0, gl.TEXTURE_2D, ",
  "2099": "attach the ",
  "2100": " and attach the ",
  "2101": "Bind the ",
  "2102": ";\n\n    // ",
  "2103": " = this.context.fbo",
  "2104": "fbo = this.context.fbo",
  "2105": "(texAttribLoc",
  "2106": "AttribArray",
  "2107": "VertexAttribArray",
  "2108": "ableVertexAttribArray",
  "2109": "enableVertexAttribArray",
  "2110": ");\n    this.gl.enableVertexAttribArray",
  "2111": ", 0, 0);\n    this.gl.enableVertexAttribArray",
  "2112": "se, 0, 0);\n    this.gl.enableVertexAttribArray",
  "2113": "alse, 0, 0);\n    this.gl.enableVertexAttribArray",
  "2114": "false, 0, 0);\n    this.gl.enableVertexAttribArray",
  "2115": ", this.gl.FLOAT, false, 0, 0);\n    this.gl.enableVertexAttribArray",
  "2116": "(posAttribLoc",
  "2117": "Pointer",
  "2118": "AttribPointer",
  "2119": "vertexAttribPointer",
  "2120": "Buffer);\n    this.gl.vertexAttribPointer",
  "2121": "this.gl.bindBuffer(this.gl.ARRAY_BUFFER, this.quad",
  "2122": "');\n    this.gl.bindBuffer(this.gl.ARRAY_BUFFER, this.quad",
  "2123": "(shaderProgram, '",
  "2124": "ation(shaderProgram, '",
  "2125": "AttribLocation(shaderProgram, '",
  "2126": "getAttribLocation(shaderProgram, '",
  "2127": " = this.gl.getAttribLocation(shaderProgram, '",
  "2128": "pointer",
  "2129": "to the ",
  "2130": "standard ",
  "2131": "RAW",
  "2132": "DRAW",
  "2133": "_DRAW",
  "2134": "C_DRAW",
  "2135": "IC_DRAW",
  "2136": "ATIC_DRAW",
  "2137": "STATIC_DRAW",
  "2138": ", this.gl.STATIC_DRAW",
  "2139": "s, this.gl.STATIC_DRAW",
  "2140": "Data(this.gl.ARRAY_BUFFER, ",
  "2141": "bufferData(this.gl.ARRAY_BUFFER, ",
  "2142": "Buffer);\n    this.gl.bufferData(this.gl.ARRAY_BUFFER, ",
  "2143": "();\n    this.gl.bindBuffer(this.gl.ARRAY_BUFFER, this.quad",
  "2144": "Buffer();\n    this.gl.bindBuffer(this.gl.ARRAY_BUFFER, this.quad",
  "2145": " = this.gl.createBuffer();\n    this.gl.bindBuffer(this.gl.ARRAY_BUFFER, this.quad",
